{
  "head":{
    "250":"Python",
    "179":"OData Requests",
    "22":"Azure Functions",
    "302":"Azure Firewall",
    "48":"Azure Pipelines",
    "87":"PP365",
    "94":"Azure Functions Quickstart",
    "134":"Dataverse",
    "6":"Conditional Access",
    "323":"OAuth2.0",
    "32":"Python",
    "164":"Kaggle",
    "98":"Diffusers Library",
    "239":"Python",
    "199":"Diffusers Library",
    "65":"MS Identity Platform",
    "9":"Azure AI Search",
    "175":"Python",
    "226":"MS Identity Platform",
    "273":"OData",
    "42":"Power BI",
    "130":"Dataverse Queries",
    "297":"Conditional Access",
    "172":"OData Requests",
    "192":"sklearn",
    "309":"OData",
    "119":"MS Dataverse",
    "43":"Dataverse Queries",
    "24":"Diffusers Library",
    "270":"OData",
    "362":"HuggingFace diffusers",
    "121":"sklearn",
    "357":"Developer Mode",
    "103":"Azure AI Search",
    "339":"Kaggle",
    "120":"Diffusers Library",
    "56":"Azure Key Vault Secrets",
    "66":"Python",
    "285":"Azure VDI Project",
    "324":"OData Requests",
    "364":"HuggingFace diffusers",
    "317":"OData",
    "78":"Python",
    "188":"Maths",
    "352":"Diffusers Documentation",
    "347":"Azure Functions ",
    "313":"Diffusers Library",
    "220":"RAG",
    "54":"numpy",
    "229":"Azure Functions Quickstart",
    "68":"sklearn",
    "277":"pandas",
    "74":"Azure AI Search",
    "157":"sklearn ",
    "0":"Azure Functions",
    "34":"Power BI",
    "281":"sklearn",
    "154":"Power BI",
    "214":"Azure Storage",
    "301":"PP365",
    "195":"OData",
    "150":"General",
    "320":"numpy",
    "251":"DNS",
    "29":"OData Requests",
    "14":"MS Data Analyst",
    "197":"sklearn ",
    "30":"PP365",
    "286":"DNS",
    "340":"MS Identity Platform",
    "140":"Dataverse",
    "219":"Python",
    "27":"Maths",
    "325":"Azure Functions",
    "110":"sklearn ",
    "69":"Conditional Access",
    "351":"Diffusers Documentation",
    "299":"Power BI",
    "283":"Dataverse Queries",
    "298":"Workera.ai",
    "26":"Python",
    "221":"Power Platform Administration",
    "252":"sklearn ",
    "287":"MS Identity Platform",
    "241":"Conditional Access",
    "205":"DNS",
    "315":"Python",
    "156":"DNS",
    "276":"Kaggle",
    "44":"UHero Requests",
    "61":"sklearn",
    "233":"Diffusers Library",
    "333":"MS Identity Platform",
    "153":"Power BI",
    "322":"Python",
    "171":"DAX Studio",
    "247":"Dataverse",
    "4":"Python",
    "93":"sklearn ",
    "176":"Python",
    "209":"Microsoft Fabric Administration",
    "162":"Dataverse Queries",
    "335":"sklearn ",
    "180":"Workera.ai",
    "215":"Azure OpenAI",
    "249":"pandas",
    "307":"Azure OpenAI",
    "236":"pandas",
    "304":"MS Identity Platform",
    "203":"Diffusers Library",
    "64":"Azure AI Search",
    "194":"Azure Functions ",
    "84":"Power BI",
    "289":"sklearn ",
    "2":"UHero Requests",
    "62":"MS Data Analyst",
    "11":"General",
    "170":"IW Migration",
    "190":"OAuth2.0",
    "260":"GitHub codespaces",
    "312":"Diffusers Library",
    "280":"Azure Functions",
    "79":"Dataverse Queries",
    "204":"Conditional Access",
    "106":"Power BI",
    "83":"Diffusers Library",
    "318":"Workera.ai",
    "254":"Diffusers Library",
    "184":"Azure VDI Project",
    "12":"Azure AI Search",
    "142":"OData Requests",
    "3":"sklearn",
    "191":"Windows 10",
    "288":"Python",
    "234":"Power BI",
    "348":"Azure Functions ",
    "294":"Tax stuff",
    "310":"Power Platform",
    "341":"sklearn ",
    "82":"Power BI",
    "101":"Azure VDI Project",
    "75":"DNS",
    "305":"Python",
    "138":"Python",
    "35":"Dataverse Queries",
    "201":"General",
    "235":"Power Platform",
    "33":"pandas",
    "17":"Workera.ai",
    "344":"Azure Functions ",
    "137":"Azure AI Search",
    "264":"Power Platform",
    "177":"Dataverse",
    "185":"MS Data Analyst",
    "50":"Azure Storage",
    "1":"Diffusers Library",
    "342":"PP365",
    "63":"General",
    "36":"MS Dataverse",
    "345":"Azure Functions ",
    "213":"Python",
    "21":"Maths",
    "207":"Azure Storage",
    "196":"Power Platform administration",
    "108":"Conditional Access",
    "91":"Power BI Desktop",
    "355":"Diffusers Documentation",
    "200":"Diffusers Library",
    "45":"Site Scraping",
    "306":"PP365",
    "303":"Azure AI Search",
    "227":"Python",
    "182":"Python",
    "265":"Git",
    "125":"PP365",
    "105":"Azure Functions",
    "228":"Power BI",
    "363":"HuggingFace diffusers",
    "135":"General",
    "113":"Workera.ai",
    "359":"Developer Mode",
    "149":"\n4",
    "230":"Azure AI Search",
    "124":"Python",
    "292":"MS Identity Platform",
    "71":"OData",
    "218":"Azure AI Search",
    "109":"Power BI",
    "206":"PP365",
    "151":"Power BI",
    "8":"Azure VDI Project",
    "123":"Microsoft Copilot Studio",
    "126":"MS Identity Platform",
    "346":"Azure Functions ",
    "187":"Azure Functions Quickstart",
    "127":"General",
    "361":"HuggingFace diffusers",
    "129":"RAG",
    "67":"Python",
    "16":"Diffusers Library",
    "329":"Azure VDI Project",
    "186":"UHero Requests",
    "90":"DNS",
    "222":"Accounting",
    "52":"MS Identity Platform",
    "25":"Python",
    "115":"Dataverse Queries",
    "31":"Power BI",
    "272":"Python",
    "178":"sklearn",
    "158":"Workera.ai",
    "5":"Python",
    "356":"Developer Mode",
    "202":"sklearn ",
    "77":"DNS",
    "10":"Diffusers Library",
    "332":"Python",
    "57":"Conditional Access",
    "327":"OData Requests",
    "316":"Git",
    "15":"Azure AI Search",
    "334":"Diffusers Library",
    "39":"Azure",
    "143":"sklearn ",
    "330":"sklearn",
    "189":"Azure Storage",
    "47":"PP365",
    "211":"Python",
    "308":"Python",
    "338":"GitHub codespaces",
    "183":"Azure Functions Quickstart",
    "269":"sklearn",
    "19":"Python",
    "243":"Dataverse Queries",
    "148":"sklearn",
    "232":"Git",
    "240":"MS Identity Platform",
    "165":"MS Identity Platform",
    "314":"sklearn",
    "76":"OData Requests",
    "141":"Kaggle",
    "245":"MS Identity Platform",
    "40":"Git",
    "295":"pandas",
    "128":"General",
    "253":"Azure Functions Quickstart",
    "231":"numpy",
    "95":"sklearn",
    "96":"Python",
    "237":"Conditional Access",
    "167":"Azure VDI Project",
    "336":"Diffusers Library",
    "97":"numpy",
    "290":"DNS",
    "46":"sklearn",
    "111":"Power Platform administration",
    "7":"Diffusers Library",
    "360":"Developer Mode",
    "166":"Diffusers Library",
    "278":"Dataverse Queries",
    "331":"Azure Functions",
    "174":"Diffusers Library",
    "73":"Diffusers Library",
    "225":"Azure OpenAI",
    "38":"Python",
    "257":"Diffusers Library",
    "23":"Python",
    "159":"Power Apps",
    "319":"OData",
    "49":"Azure AI Search",
    "133":"Azure Functions ",
    "155":"Workera.ai",
    "81":"Diffusers Library",
    "242":"Child Services AWS Review",
    "261":"Terraform",
    "104":"Python",
    "326":"Diffusers Library",
    "58":"Python",
    "311":"Azure Functions Quickstart",
    "262":"Azure AI Search",
    "282":"Azure AI Search",
    "161":"Python",
    "152":"UHero Requests",
    "102":"Dataverse",
    "181":"Python",
    "60":"PP365",
    "291":"Diffusers Library",
    "216":"UHero Requests",
    "349":"Azure Functions ",
    "293":"sklearn ",
    "212":"General",
    "122":"Power BI",
    "258":"Azure AI Search",
    "284":"Azure OpenAI",
    "217":"Azure OpenAI",
    "193":"PP365",
    "144":"Azure OpenAI",
    "80":"OData",
    "132":"Azure Functions",
    "160":"Python",
    "55":"DNS",
    "223":"sklearn",
    "169":"sklearn ",
    "107":"DNS",
    "238":"DNS",
    "51":"DNS",
    "350":"Diffusers Documentation",
    "300":"Azure Storage",
    "85":"Azure VM Image Builder",
    "275":"General",
    "267":"Azure Functions ",
    "274":"Azure Pipelines",
    "100":"Azure Storage",
    "244":"Diffusers Library",
    "147":"Dataverse",
    "99":"Python",
    "145":"Azure Functions",
    "72":"Power BI Desktop",
    "112":"Power BI",
    "20":"Power BI",
    "343":"Azure Functions ",
    "118":"Diffusers Library",
    "92":"Diffusers Library",
    "208":"Dataverse",
    "18":"MS Identity Platform",
    "210":"MS Identity Platform",
    "246":"Azure Functions",
    "163":"Python",
    "168":"Power BI",
    "114":"\n",
    "70":"Python",
    "321":"RAG",
    "117":"Python",
    "59":"Conditional Access",
    "131":"Python",
    "271":"MS Dataverse ",
    "136":"pandas",
    "255":"Python",
    "328":"OAuth2.0",
    "53":"OData",
    "358":"Developer Mode",
    "88":"OAuth2.0",
    "89":"Git",
    "256":"OData Requests",
    "28":"MS Identity Platform",
    "198":"sklearn",
    "263":"Diffusers Library",
    "116":"pandas",
    "41":"Diffusers Library",
    "139":"Python",
    "353":"Diffusers Documentation",
    "13":"Azure CLI",
    "224":"Git",
    "279":"Diffusers Library",
    "268":"Diffusers Library",
    "86":"UHero Requests",
    "354":"Diffusers Documentation",
    "173":"sklearn ",
    "266":"Conditional Access",
    "146":"Diffusers Library",
    "296":"Site Scraping",
    "259":"Git",
    "37":"Azure Functions",
    "248":"Azure VDI Project",
    "337":"OData"
  },
  "body":{
    "250":"Aside from GET, other popular HTTP methods include POST, PUT, DELETE, HEAD, PATCH, and OPTIONS. For each of these HTTP methods, Requests provides a function, with a similar signature to get().",
    "179":"Edm.Decimal:\nA data type used in OData protocols to represent decimal numbers. Conflicts can occur when values are formatted incorrectly or incompatible with API settings, such as IEEE754Compatible, which controls floating-point number representation.",
    "22":"Function app configuration\tConnection strings, environment variables, and other application settings are defined separately for each function app. The function app settings values can be read in the code as environment variables.",
    "302":"Firewall Policy is the recommended method to configure your Azure Firewall. It's a global resource that can be used across multiple Azure Firewall instances in Secured Virtual Hubs and Hub Virtual Networks. Policies work across regions and subscriptions.",
    "48":"Job\nA build contains one or more jobs. Most jobs run on an agent. A job represents an execution boundary of a set of steps. All the steps run together on the same agent.\n\nFor example, you might build two configurations - x86 and x64. In this case, you have one build and two jobs.",
    "87":"Grids: Grids are tabular representations of data within a model-driven app in Power Apps. They allow users to view and interact with rows of data from a table. Grids can be configured to show specific columns and can be customized to include features like sorting, filtering, and pagination.",
    "94":"Before you can publish your Functions project to Azure, you must have a function app and related resources in your Azure subscription to run your code. The function app provides an execution context for your functions. When you publish from Visual Studio Code to a function app in Azure, the project is packaged and deployed to the selected function app in your Azure subscription.",
    "134":"Device Code Flow:\n\nDefinition: A type of OAuth2 flow designed for devices with limited input capabilities, where the user is prompted to visit a URL on another device and authenticate by entering a code.\nContext: We used this in MSAL to allow for interactive authentication and MFA.",
    "6":"We need Microsoft Entra P1 or P2 licenses for each user to implement risk-based policies AND alerts in Microsoft Entra ID. These are not included in our current Windows Licenses (Business Premium).",
    "323":"The spa redirect type is backward-compatible with the implicit flow. Apps currently using the implicit flow to get tokens can move to the spa redirect URI type without issues and continue using the implicit flow. Despite this backward compatibility, we recommend that you use the auth code flow with PKCE for SPAs.",
    "32":"To make a request to GitHub’s authenticated user API, you first need to generate a personal access token with the read:user scope. Then you can pass this token as the second element in a tuple to get():\n\n>>> import requests\n>>> token = \"<YOUR_GITHUB_PA_TOKEN>\"\n>>> response = requests.get(\n...     \"https:\/\/api.github.com\/user\",\n...     auth=(\"\", token)\n... )",
    "164":"Once we've identified the shape of the trend, we can attempt to model it using a time-step feature. We've already seen how using the time dummy itself will model a linear trend:\ntarget = a * time + b\n\nWe can fit many other kinds of trend through transformations of the time dummy. If the trend appears to be quadratic (a parabola), we just need to add the square of the time dummy to the feature set, giving us:\ntarget = a * time ** 2 + b * time + c",
    "98":"Bayesian Inference\nThe process of updating probabilities based on new data, often used to refine diffusion model outputs. Bayesian inference adjusts prior beliefs about data distribution with observed data, allowing for improved posterior estimates in reverse diffusion steps, enhancing image realism.",
    "239":"The first bit of information that you can gather from Response is the status code. A status code informs you of the status of the request.\n\nFor example, a 200 OK status means that your request was successful, whereas a 404 NOT FOUND status means that the resource you were looking for wasn’t found. There are many other possible status codes as well to give you specific insights into what happened with your request.",
    "199":"There are three main components of the library to know about:\nThe DiffusionPipeline is a high-level end-to-end class designed to rapidly generate samples from pretrained diffusion models for inference.",
    "65":"Single-page applications: Also known as SPAs, these are web apps in which tokens are acquired by a JavaScript or TypeScript app running in the browser. Many modern apps have a single-page application at the front end that's primarily written in JavaScript. The application often uses a framework like Angular, React, or Vue. MSAL.js is the only Microsoft Authentication Library that supports single-page applications.",
    "9":"Scalar Quantization: Scalar Quantization reduces the precision of individual scalar values within vectors. This balances the trade-off between compression ratio and accuracy, optimizing the performance of vector-based searches while maintaining sufficient detail for effective search results.",
    "175":">>> import math\n>>> math.pi\n3.141592653589793\n>>> f\"{math.pi:.4f}\"\n'3.1416'\n>>> \"{pi:.4f}\".format(pi=math.pi)\n'3.1416'",
    "226":"Integrated Windows Authentication has been replaced with a more reliable way of getting tokens silently - WAM. WAM can login the current windows user silently. This workflow does not require complex setup and it even works for personal (Microsoft) accounts. Internally, the Windows Broker (WAM) will try several strategies to get a token for the current Windows user, including IWA and redeeming the PRT. This eliminates most of the limitations with IWA.",
    "273":"Function\nA function in OData is an operation that can be invoked on data but does not modify the data itself. Functions are used for read-only operations, such as calculating values or retrieving specific data. They can be defined in the OData metadata.",
    "42":"To define a column in Power BI (DAX) that takes the non-blank value between two existing columns, or remains blank if both are blank, you can use the COALESCE function. Here's an example of how you can achieve this:\n\nNewColumn = COALESCE([Column1], [Column2])",
    "130":"FetchXML\nDefinition: A proprietary query language used in Dataverse for more advanced querying capabilities. Although the Web API primarily supports OData queries, FetchXML can be used for complex querying scenarios such as joins, aggregates, and advanced filtering.\nRelevance: FetchXML is particularly useful for scenarios where OData query limitations are encountered. It can be executed using the Web API through the RetrieveMultiple message.",
    "297":"Report-only: Not applied\t\nNot all configured policy conditions were satisfied. For example, the user is excluded from the policy or the policy only applies to certain trusted named locations.",
    "172":"@odata.bind:\nA special syntax used in OData API requests to associate lookup fields with related entity records. It requires specifying the related entity's logical name and GUID to establish the relationship.",
    "192":"By default, parameter search uses the score function of the estimator to evaluate a parameter setting. These are the sklearn.metrics.accuracy_score for classification and sklearn.metrics.r2_score for regression. For some applications, other scoring functions are better suited (for example in unbalanced classification, the accuracy score is often uninformative). An alternative scoring function can be specified via the scoring parameter of most parameter search tools.",
    "309":"$orderby\nThe $orderby query option lets clients specify the order in which the data should be returned. For instance, you can use it to sort a list of entities in ascending or descending order based on specific properties, such as sorting products by price.",
    "119":"Fiddler is a web debugging proxy used to view HTTP traffic on your computer. Viewing this data is useful when debugging scripts. By default, HTTP requests and responses sent using Invoke-RestMethod cmdlet won't be visible using Fiddler",
    "43":"Filter Query\nDefinition: A part of the OData query that allows filtering of data based on specific conditions. In this case, filtering was used to select rows where ts_engagementid equals a certain GUID.\nExample: $filter=ts_engagementid\/Id eq {engagement_id}",
    "24":"Conditioning\nThe process of guiding model output by adding information, such as text prompts or class labels. Conditioning allows the model to generate images aligned with specific instructions, enabling customizable and context-aware image creation.",
    "270":"$expand\nThe $expand query option is used to include related entities in the response. For example, if you are querying a customer entity, you can use $expand to retrieve their associated orders or addresses in the same query, enabling easier navigation of related data.",
    "362":"Unlike standard .pt or .bin files, which can execute arbitrary Python code and are therefore vulnerable to malicious modifications, safetensors files contain only tensor data and metadata, with no executable code. This makes them safer for sharing and loading model weights directly from untrusted sources.",
    "121":"Neighbors-based regression can be used in cases where the data labels are continuous rather than discrete variables. The basic idea is that if point A is very distant from point B, and point B is very close to point C, then we know that points A and C are very distant, without having to explicitly calculate their distance.",
    "357":"You can go to the For developers settings page at any time to enable or disable Developer Mode. Simply enter for developers into the search box in the taskbar.",
    "103":"Hierarchical Data Understanding: Matryoshka Representation Learning (MRL) employs a nested, layered approach to representation learning, enabling Azure AI Search to capture complex, multi-level relationships within data. This hierarchical structure improves the model’s ability to understand and represent intricate data patterns effectively.",
    "339":"In Lesson 1, we engineered our time dummy in Pandas directly. From now on, however, we'll use a function from the statsmodels library called DeterministicProcess. Using this function will help us avoid some tricky failure cases that can arise with time series and linear regression. The order argument refers to polynomial order: 1 for linear, 2 for quadratic, 3 for cubic, and so on.",
    "120":"Markov Chain\nA sequence of random variables where each state depends only on the previous one. In diffusion models, the noise addition process is modeled as a Markov chain, allowing controlled transitions from clear images to noisy ones and vice versa, simplifying the math for training.",
    "56":"Key Vault also supports a contentType field for secrets. Clients may specify the content type of a secret to help interpreting the secret data when it's retrieved. The maximum length of this field is 255 characters. The suggested usage is as a hint for interpreting the secret data. For instance, an implementation may store both passwords and certificates as secrets, then use this field to differentiate.",
    "66":"When you try to create an instance of a class that inherits from the Sequence abstract base class, but doesn’t implement .__getitem__() and .__len__(), then Python raises a TypeError:\n\nThe Sequence abstract base class requires that any class that inherits from it must implement the .__getitem__() and .__len__() methods.",
    "285":"The terraform plan -refresh-only option generates a plan that only refreshes the state without proposing any changes to infrastructure. This is useful for seeing the current state of resources, particularly when changes have been made outside of Terraform, allowing you to compare infrastructure with the configuration.",
    "324":"IEEE754Compatible:\nA setting in web APIs that controls how floating-point numbers are handled. If set to true, numbers are represented in string format to avoid precision loss, otherwise, they are treated as typical decimal numbers.",
    "364":"safetensors is supported by the Hugging Face transformers and diffusers libraries, making it accessible for various deep learning applications. Models in the safetensors format can usually be loaded with minimal changes to code.",
    "317":"$skip\nThe $skip query option is used to skip a specified number of results from the start of the result set. It is commonly used in combination with $top to paginate through large data sets, allowing clients to retrieve data in chunks.",
    "78":"Augmented assignment operators provide a more concise way to update the value of a variable. For example, counter += 1 is a shorthand for counter = counter + 1.\n\nThese operators rely on special methods like .__iadd__() for in-place operations. If the data type is mutable, then Python performs the operation in place. If the data type is immutable, Python returns a new object with the updated value.",
    "188":"Generalized likelihood ratio test (GLRT) is a statistical test to compare the fit of two models, one of which is a special case of the other (nested models).",
    "352":"Sometimes, old environment paths can linger in the registry or elsewhere in the system’s path cache, causing confusion about which Python executable should be used. Running python -m pip explicitly tells the Python interpreter itself to find the correct pip module, sidestepping any possible confusion from old, broken pip links.",
    "347":"Azure Blob Storage - Blob Storage bindings allow you to read from a blob.\n\nAzure Cosmos DB - Azure Cosmos DB input bindings use the SQL API to retrieve one or more Azure Cosmos DB documents, and pass them to the input parameter of the function. The document ID, or query parameters, can be determined based on the trigger that invokes the function.",
    "313":"Noise Schedule\nA sequence controlling the amount of noise added to images at each diffusion step. This progressive reduction allows the model to learn to denoise by removing specific levels of noise at each step, eventually generating a clear image from the noise.",
    "220":"One prevalent challenge when implementing language models through chat is the so-called groundedness, which refers to whether a response is rooted, connected, or anchored in reality or a specific context. In other words, groundedness refers to whether the response of a language model is based on factual information.",
    "54":"numpy.where(condition, [x, y, ]\/)\n\nFirst of all, the definition ends with a forward slash (\/) character. You might think this represents a division or line continuation symbol, but it’s neither. By placing the forward slash special parameter at the end, the documentation is telling you that each parameter passed must be passed by position and not by keyword.",
    "229":"Purpose: Meta-packages are often used to provide a convenient way to install a set of packages that are commonly used together. This can be particularly useful in complex environments where multiple packages are needed to provide full functionality.",
    "68":"The k-means algorithm divides a set of N samples into X an K disjoint clusters C, each described with the mean mu_j of the samples in the cluster. The means are commonly called the cluster \"centroids\"; note that they are not, in general, points from X, although they live in the same space.",
    "277":"Expanding List-Like Elements into Rows using explode: The explode method transforms each element of a list-like column into separate rows by applying DataFrame.explode. This allows you to analyze each list element individually in a row-wise fashion.",
    "74":"Efficient Text Processing: The Text Split skill breaks down large text documents into smaller, manageable token chunks. This facilitates more efficient indexing and processing within Azure AI Search, ensuring that each segment is handled optimally.",
    "157":"In the basic approach of cross-validation, called k-fold CV, the training set is split into k smaller sets. The following procedure is followed for each of the k “folds”:\n\nA model is trained using k-1 of the folds as training data;\nthe resulting model is validated on the remaining part of the data (i.e., it is used as a test set to compute a performance measure such as accuracy).",
    "0":"A trigger is an object that defines a specific function. For example, if you want a function to execute every 10 minutes, you could use a timer trigger.\n\nEvery function must have exactly one trigger associated with it. If you want to execute a piece of logic that runs under multiple conditions, you need to create multiple functions that share the same core function code.",
    "34":"API Request Configuration in Power BI: When integrating the BLS Public Data API, you need the API endpoint URL, HTTP request type (GET or POST), and payload with series IDs, date ranges, and optional parameters. Requests for multiple series or additional features like calculations are often handled via POST requests with a JSON body.",
    "281":"Neighbors-based classification is computed from a simple majority vote of the nearest neighbors of each point: a query point is assigned the data class which has the most representatives within the nearest neighbors of the point.",
    "154":"Power Query Response Parsing: After receiving the API response, Power BI parses the data using Json.Document(). You can expand and transform nested records and lists within the Power Query Editor. This enables you to prepare the data for visualizations or further analysis within Power BI.",
    "214":"A storage account is a container that groups a set of Azure Storage services together. Only data services from Azure Storage can be included in a storage account (Azure Blobs, Azure Files, Azure Queues, and Azure Tables). The following illustration shows a storage account containing several data services.",
    "301":"Background operations (optional)\tSelect to disable all asynchronous operations (see Asynchronous service) such as workflows and synchronization with Exchange. Emails will not be sent and server-side synchronization for appointments, contacts, and tasks are disabled. Note: Administration mode must be enabled to disable background operations.",
    "195":"Navigation Property\nA navigation property defines the relationship between two entity types in OData, such as a one-to-many or many-to-many relationship. It allows clients to navigate from one entity to another, like retrieving all orders for a specific customer.",
    "150":"[Win] + [ctrl] + [v] opens the windows audio device selection menu in Windows 11. Very helpful.",
    "320":"For example, you could have created your own randomized version of test_array using the following:\n\n>>> test_array = np.random.uniform(low=-10, high=10, size=(3, 4))\n>>> test_array\narray([[-2.71697178, -2.49701546, -7.57662054, -9.41817892],\n       [ 2.43095102,  0.7143025 ,  0.25938839, -4.78215376],\n       [-7.13802191, -5.47446998, -0.47173589, -0.36727671]])",
    "251":"• DNS Tunneling:\nA method of encapsulating data within DNS queries and responses to bypass network firewalls and restrictions, often used in data exfiltration or command-and-control channels.",
    "29":"Deserialization in APIs:\nThe process of converting data from a JSON or serialized format into a usable object in the API server. Errors can arise if the input data does not match the expected schema or types during deserialization.",
    "14":"At report design time in Microsoft Power BI Desktop, you can create measures (except when the model is a live connection to SQL Server Analysis Services multidimensional model). These measures belong to the report, and so they're called report-level measures.",
    "197":"LeavePGroupsOut: This cross-validation technique splits data based on group labels, leaving out all data points with a specific group label in each fold. Useful for datasets with naturally grouped data, where each group should either entirely be in training or test sets.",
    "30":"You can call on-demand workflows from inside a business process flow. You can configure this from the new business process flow designer by dragging a workflow component to a process stage or to the Global Workflows section.",
    "286":"• DNS Rebinding:\nA technique used by attackers to bypass the same-origin policy in browsers, allowing them to interact with private networks by making the DNS response point to a local IP address after an initial resolution to a public IP.",
    "340":"The redirect URIs to use in a desktop application depend on the flow you want to use.\n\nSpecify the redirect URI for your app by configuring the platform settings for the app in App registrations in the Microsoft Entra admin center.\n\nFor apps that use Web Authentication Manager (WAM), redirect URIs need not be configured in MSAL, but they must be configured in the app registration.",
    "140":"Confidential Client:\n\nDefinition: An application type in OAuth2 that requires a client secret or assertion, typically used by server-based or service applications.\nContext: Initially, your app was likely configured as a confidential client, which caused the error when we tried using Device Code Flow.",
    "219":"Named replacement fields allow you to insert values from a dictionary into a string by using keys. This method is more readable and intuitive than using positional arguments with tuples.",
    "27":"Regularity conditions are mathematical conditions or assumptions required for certain statistical methods to be valid, like smoothness and boundedness of functions involved in estimation or hypothesis testing.",
    "325":"Serverless workflow. A series of functions can be chained together, and you can introduce state which makes it possible to devise complex long running workflows via Durable Functions. Another choice for workflows is Logic apps that can monitor external events, perform branching logic and invoke functions as a result.",
    "110":"An alternative to cross-validation, bootstrapping involves repeatedly sampling data with replacement and evaluating model performance across these samples. It’s effective for small datasets, providing robust estimates of model variance but may not reflect real test distributions as accurately as cross-validation.",
    "69":"With the access and session policies, you can:\nMonitor user sessions for compliance: Risky users are monitored when they sign into apps and their actions are logged from within the session. You can investigate and analyze user behavior to understand where, and under what conditions, session policies should be applied in the future.",
    "351":"On Windows, pip relies on a small launcher executable that links to the correct Python interpreter and pip package. If Python was uninstalled and reinstalled in a new location, the link in that launcher may be broken or still pointing to the old installation path, even if the correct paths are in the Path variable. This causes pip alone to fail, as it tries to find the old, non-existent Python.",
    "299":"If there are data sources being accessed within the partition, and data flowing in from other partitions, the Firewall loses its ability to be the gatekeeper, since the data flowing in could be leaked to one of the internally accessed data sources without it knowing about it. Thus the Firewall prevents a partition that accesses other partitions from being allowed to directly access any data sources.",
    "283":"Entity Bound Actions\nDefinition: These are custom or system-defined actions that are tied to a specific entity and can be invoked via the Web API to perform tasks or trigger workflows.\nRelevance: Entity-bound actions are useful for performing more complex business logic or automation that is triggered based on a record in an entity. For example, triggering a workflow on an engagement task when it's completed.",
    "298":"Geographical Separation: Azure Region Pairs consist of two regions within the same geography but separated by a significant distance to protect against regional disasters. This ensures that in the event of a natural disaster or significant outage in one region, the paired region remains operational, thereby providing enhanced disaster recovery capabilities.",
    "26":"With f-strings, you can use a feature known as self-documenting expressions that adds an equal sign after the interpolated variable or expression. This feature can help you debug your code. \n\n>>> value = \"Suspicious value\"\n\n>>> print(f\"{value = }\")\nvariable = 'Suspicious value'",
    "221":"Relevance Search Integration: Quick Find can be integrated with Dataverse's Relevance Search feature, which leverages Azure Search to provide more advanced search capabilities. This includes full-text search, relevance scoring, and the ability to search across multiple entities at once. Relevance Search enhances the Quick Find experience by providing more powerful and flexible search options, making it easier to locate records across the Dataverse environment.",
    "252":"Generalization Error: Generalization error is the measure of a model’s ability to accurately predict outcomes for new, unseen data. Lower generalization error indicates a model that performs well beyond its training data, whereas high error suggests overfitting or poor predictive power.",
    "287":"Resource server - The resource server hosts or provides access to a resource owner's data. Most often, the resource server is a web API fronting a data store. The resource server relies on the authorization server to perform authentication and uses information in bearer tokens issued by the authorization server to grant or deny access to resources.",
    "241":"Require app protection policy - This access-blocking policy also has the potential to block access for all users in your organization if you don't have an Intune policy. If you're an administrator without a client application that has an Intune app protection policy, this policy blocks you from getting back into portals such as Intune and Azure.",
    "205":"• DNS Filtering:\nA security practice where DNS queries are monitored and filtered to block access to harmful or unauthorized domains.",
    "315":"Python sequences have three common characteristics:\n\n  They are iterable, which means you can iterate through them.\n  They have a length, which means you can pass them to len() to get the number of elements it contains.\n  An element of a sequence can be accessed based on its position in the sequence using an integer index.",
    "156":"• Security Appliance:\nA dedicated hardware device designed to protect a network by filtering traffic, detecting intrusions, or performing other security functions.",
    "276":"I created a shifted, lag feature for my time series using the following syntax. Turns out the pandas shift() function will respect the groupby() groups, in this case the different engagements.\n\ndf['cumulative_hours_lag'] = df.groupby('EngagementID')['cumulative_hours'].shift(1)",
    "44":"WebDriverWait:\nWebDriverWait is a Selenium function that pauses execution until a certain condition is met (e.g., waiting for an element to load). It's useful when dealing with dynamic websites where elements take time to appear after a page load.",
    "61":"Neighbors-based classification is a type of instance-based learning or non-generalizing learning: it does not attempt to construct a general internal model, but simply stores instances of the training data.",
    "233":"Denoising Process\nThe step-by-step refinement in diffusion models where the model removes noise from a random input, progressing towards an image. At each step, the model estimates the noise in the image and subtracts it, gradually enhancing coherence and detail.",
    "333":"ID token - ID tokens are sent to the client application as part of an OpenID Connect flow. They can be sent alongside or instead of an access token. ID tokens are used by the client to authenticate the user. To learn more about how the Microsoft identity platform issues ID tokens, see ID tokens in the Microsoft identity platform.",
    "153":"Creating POST Requests in Power Query: You can modify Power Query M code to create a POST request by specifying the endpoint URL, headers (such as Content-Type: application\/json), and request body. The body is structured as JSON using Json.FromValue(), converted to binary with Text.ToBinary(), and passed to the Web.Contents() function.",
    "322":"The purpose of the .__init__() method in a Python class is to initialize instance attributes.\n\nWhen you create an instance of a class, Python automatically calls .__init__() using the same arguments that you’ve passed to the constructor. This method sets up the initial state of the object by assigning values to instance attributes.",
    "171":"Referencing Tables Using EVALUATE: You can also reference entire tables using EVALUATE. For example, if you want to return the Products Table, execute EVALUATE Products.",
    "247":"Authorization Code Flow:\n\nDefinition: An OAuth2 flow used by public clients (like single-page apps or mobile apps) where the user signs in interactively, providing credentials, and possibly undergoing multi-factor authentication (MFA).\nContext: We discussed this flow as an alternative to the Client Credentials Flow because you wanted MFA to be required.",
    "4":"The re.sub function replaces all occurrences of a specified pattern in a string with a given replacement by default. If you want to replace only the first instance, you can use the count parameter and set it to 1.",
    "93":"Data leakage occurs when information from the test set inadvertently influences the model during training, leading to overly optimistic performance. Cross-validation methods that respect data structure, like LeavePGroupsOut or TimeSeriesSplit, help prevent this risk.",
    "176":"To customize headers, you pass a dictionary of HTTP headers to get() using the headers parameter. For example, you can change your previous search request to highlight matching search terms in the results by specifying the text-match media type in the Accept header:\n\nimport requests\n\nresponse = requests.get(\n    \"https:\/\/api.github.com\/search\/repositories\",\n    params={\"q\": '\"real python\"'},\n    headers={\"Accept\": \"application\/vnd.github.text-match+json\"},\n)",
    "209":"Consumption in Fabric is measured using capacity units (CUs). Using the Capacity Metrics app admins can view consumption in their organization. This report enables you to make informed decisions regarding the use of your organizational resources.",
    "162":"Change Tracking\nDefinition: A feature that allows the tracking of changes made to data in Dataverse entities. The Web API exposes a mechanism to track when records have been created, updated, or deleted.\nRelevance: Useful for scenarios like synchronizing data between systems or auditing changes in your data. The $deltatoken query parameter is used to fetch only the changes since the last request, improving efficiency.",
    "335":"When the cv argument is an integer, cross_val_score uses the KFold or StratifiedKFold strategies by default, the latter being used if the estimator derives from ClassifierMixin.\n\nfrom sklearn import metrics\nscores = cross_val_score(\n    clf, X, y, cv=5, scoring='f1_macro')\nscores\narray([0.96..., 1.  ..., 0.96..., 0.96..., 1.        ])",
    "180":"Automatic Replication and Failover: Certain services, such as Azure Storage, automatically replicate data between region pairs. This replication helps ensure that your data is always available, even if one region experiences an outage. Additionally, Azure prioritizes the restoration of services in region pairs to ensure a quicker recovery time.",
    "215":"Assistant \nCustom AI that uses Azure OpenAI models in conjunction with tools.\n\nMessage\nA message created by an Assistant or user. Messages can include text, images, and other files. Messages are stored as a list on the Thread.",
    "249":"Column-Specific Operation with explode: You can apply explode to a specific column by passing the column name to DataFrame.explode. Other columns remain unaffected, with their values duplicated alongside the new rows, maintaining the DataFrame's structural integrity.",
    "307":"Assistants can call Azure OpenAI’s models with specific instructions to tune their personality and capabilities.\nAssistants can access multiple tools in parallel. These can be both Azure OpenAI-hosted tools like code interpreter and file search, or tools you build, host, and access through function calling.",
    "236":"Custom Separators and Maximum Depth in json_normalize: The sep parameter in json_normalize lets you define a custom separator for nested keys, defaulting to a dot (.). The max_level parameter allows you to limit how deeply json_normalize flattens nested data, providing control over the normalization process.",
    "304":"OpenID Connect versus SAML: The platform uses both OpenID Connect and SAML to authenticate a user and enable single sign-on. SAML authentication is commonly used with identity providers such as Active Directory Federation Services (AD FS) federated to Microsoft Entra ID, so it's often used in enterprise applications.",
    "203":"UNet Architecture\nA neural network architecture designed for image segmentation, commonly used in diffusion models. It employs an encoder-decoder structure, where features are compressed, transformed, and then expanded to refine the image, with skip connections enabling more detailed reconstructions.",
    "64":"In your client app, the search experience is defined using APIs from Azure AI Search, and can include relevance tuning, semantic ranking, autocomplete, synonym matching, fuzzy matching, pattern matching, filter, and sort.",
    "194":"2. Suppose your Azure Function has a blob trigger associated with it and you want it to execute only when png images are uploaded. Which of the following blob trigger Path values should you use? \n\nsamples-workitems\/{name}.png\nThe Path tells the blob trigger where it should monitor for changes, and if there are any filters applied. Adding a file extension to the Path specifies that uploaded files must have that file extension in order for the trigger to invoke the function.",
    "84":"The Usage Metrics Report semantic model contains usage data for the last 30 days. It can take up to 24 hours for new usage data to be imported. You can't trigger a manual refresh by using the Power BI user interface.",
    "289":"KFold: KFold splits data into k consecutive folds (typically 5 or 10) for cross-validation, ensuring each fold is used as both a training and validation set. It’s widely used for balanced datasets, providing reliable estimates of a model’s performance on unseen data.",
    "2":"Network Tab (in DevTools):\nThe Network tab in browser DevTools tracks all network activity, including API calls (XHR, Fetch requests), CSS, and JavaScript loading. It's especially useful for identifying where data comes from and if an API can be used for scraping.",
    "62":"To create a mobile-optimized version of your report, you can:\n\nDesign a mobile layout view, where you can drag and drop certain visuals onto a phone emulator canvas.\nUse visuals and slicers that are suitable for use on small, mobile screens.",
    "11":"‘L’esprit de l’escalier’ - literally meaning 'staircase wit’ - is a French phrase sometimes used in English to describe the frustration of thinking of the perfect reply or rebuttal - but only when it’s too late.\n\nThe name for this irritating situation - which most of us have found ourselves in (usually in the workplace) - was coined by the French philosopher Denis Diderot, when he found himself in such a predicament during a dinner held by statesman Jacques Necker.",
    "170":"I was having trouble when creating the account records because I didn't have programmatic access to the fields of address2 (billing addrees). It turns out that they were protected with Column Security Profiles, and I needed to add \"Billing Profile - Full Access\" to my app registration user to get access to it. I could have probably added sys admin to the user instead, but decided not to.",
    "190":"Access tokens are short lived. Refresh them after they expire to continue accessing resources. You can do so by submitting another POST request to the \/token endpoint. Provide the refresh_token instead of the code. Refresh tokens are valid for all permissions that your client has already received consent for.",
    "260":"You can use a dotfiles repository and Settings Sync to personalize aspects of the codespace environment for any codespace that you create. Personalization can include shell preferences and additional tools. For more information, see \"Personalizing GitHub Codespaces for your account.\"",
    "312":"Entropy Regularization\nA method that adds a penalty based on entropy to encourage more diverse or structured output in diffusion models. By controlling entropy, the model can better balance between producing highly probable samples and maintaining variability in the generated images.",
    "280":"Reasons to choose WebJobs over Azure Functions\n\nYou have specific customizations that you want to make to the JobHost that aren't supported by Azure Functions.\nYou want to control your app's retry policies.\nWebJobs only supports C# on Microsoft Windows.",
    "79":"Lookup Field\nDefinition: A special type of field in Dataverse that references a record from another entity (table). It creates a relationship between two entities.\nExample: ts_engagementid is a lookup field that points to a record in the ts_engagement entity.",
    "204":"Conditional Access App Control enables user app access and sessions to be monitored and controlled in real time based on access and session policies. Access and session policies are used within Microsoft Defender for Cloud Apps portal to further refine filters and set actions to be taken on a user.",
    "106":"Transforming API Data into Usable Tables: API responses often contain nested structures (e.g., records, lists). In Power BI, you use the Expand functionality to convert these structures into tables, making the data easier to manipulate. Data transformation may include renaming columns, changing data types, or removing unnecessary fields.",
    "83":"Most models take a noisy sample, and each timestep it predicts the noise residual (other models elarn to predict the previous sample directly or hte velcity or v-prediction), the difference between a less noisy image and the input image. You can mix and match models to create other diffusion systems.",
    "318":"Azure DevTest Labs enables quick provisioning of resources such as virtual machines, allowing development and testing teams to create environments on-demand. This is particularly useful for scenarios where teams need to replicate production environments for testing purposes.",
    "254":"Sampling\nThe method of converting latent representations back into images. Sampling involves running multiple diffusion steps in reverse, gradually removing noise to produce a visually coherent image. Different sampling algorithms can influence generation speed and output quality.",
    "184":"The terraform state command family allows you to manipulate the state file directly. Commands like terraform state show, terraform state mv, and terraform state rm enable you to view, move, or remove resources from the state. This is useful for fixing discrepancies or reorganizing resources without affecting the actual infrastructure.",
    "12":"Binary Quantization: Binary Quantization converts vector embeddings into binary representations, drastically reducing their size. In Azure AI Search, binary quantization enables faster similarity computations and more efficient storage, enhancing overall search performance.",
    "142":"PATCH Request:\nA type of HTTP request used to update partial resources in an API. Unlike PUT, which replaces an entire resource, PATCH only modifies specified fields, allowing for more efficient updates.",
    "3":"The KMeans algorithm clusters data by trying to separate samples in n groups of equal variance, minimizing a criterion known as the inertia or within-cluster sum-of-squares (see below). This algorithm requires the number of clusters to be specified. It scales well to large numbers of samples and has been used across a large range of application areas in many different fields.",
    "191":"You can increase or decrease the size of icons on your desktop by selecting the desktop, holding [ctrl], and using the scroll wheel.",
    "288":"Because the decoding of bytes to a str requires an encoding scheme, Requests will try to guess the encoding based on the response’s headers if you don’t specify one. You can provide an explicit encoding by setting .encoding before accessing .text:\n\n>>> response.encoding = \"utf-8\"  # Optional: Requests infers this.\n>>> response.text\n'{\"current_user_url\":\"https:\/\/api.github.com\/user\", ...}'",
    "234":"A warning with query diagnostics, as mentioned elsewhere, is that you'll see drastically different capabilities depending on the connector. For example, many ODBC based connectors won't have an accurate recording of what query is send to the actual backend system, as Power Query only sees what it sends to the ODBC driver.",
    "348":"A binding expression is specialized text in function.json, function parameters, or code that is evaluated when the function is invoked, to yield a value. For example, if you have a Service Bus Queue binding, you could use a binding expression to obtain the name of the queue from App Settings.",
    "294":"\"TA-2\" refers to the Transient Accommodations Tax Annual Return and Reconciliation form used in Hawaii. This form is utilized by operators of transient accommodations, such as hotels and vacation rentals, to report and reconcile their annual transient accommodations tax obligations. The TA-2 form is filed in addition to periodic tax returns and serves to summarize the total gross rental proceeds and taxes due for the taxable year",
    "310":"Types of Logic Components:\n  Business process flow\n  Workflow\n  Actions\n  Business rule\n  Power Automate Flow",
    "341":"LeaveOneOut: This cross-validation technique uses every single observation as its own test set, leaving all other points as the training set. While it provides precise model evaluation, it is computationally expensive, particularly for large datasets.",
    "82":"In Power Query Diagnostics, 'Diagnose Step' is more useful for getting an insight into what evaluations are happening up to a single step, which can help you identify, up to that step, what performance is like as well as what parts of your query are being performed locally or remotely.",
    "101":"1. You have a group of developers that need virtual desktops that they can manage. What type of host pool do you create for them? \n\nWith a personal host pool, each user has their own dedicated VM. They can be a local administrator for their VM to manage app installation.",
    "75":"• Transparent DNS Proxy:\nA network setup where DNS queries are intercepted and automatically redirected to a designated DNS server without the user’s explicit configuration.",
    "305":"In Python, arithmetic operators are supported by corresponding magic methods. For example, the + operator is supported by .__add__(), and the - operator is supported by .__sub__().\n\nThese methods allow you to define custom behavior for these operators in your classes.",
    "138":"You don’t need to use a dedicated tool to create a README file for your project. You can use any plain text editor for this task. However, there are many tools available that can help automate the README creation process. You can read more about this in the section on tools for README creation.",
    "35":"Pagination and $top\nDefinition: Pagination refers to breaking down large sets of data into smaller, more manageable chunks. The $top query parameter controls how many records are returned in a single request.\nRelevance: For performance reasons, Dataverse limits the number of records returned in a single API request. Pagination, along with $top, helps in retrieving large datasets incrementally without overwhelming the system.",
    "201":"Hotpatching: A feature that allows for installing updates on virtual machines without the need for a reboot, minimizing downtime and disruption.",
    "235":"UI Component: View\nViews define how a list of rows for a specific table is displayed in your application. A view defines the columns to display, width of each column, sort behavior, and the default filters.",
    "33":"Control Over Record Path and Metadata in json_normalize: With json_normalize, you can specify the path to the records you want to normalize using the record_path parameter. The meta parameter in json_normalize allows you to include metadata from parent levels, ensuring hierarchical data is accurately represented.",
    "17":"Azure Container Network Interface (CNI) plug-ins in Azure are designed to seamlessly integrate with Azure networking services. This integration ensures that containers can communicate with other resources in the Azure environment and take advantage of features like virtual networks, load balancers, and security groups.",
    "344":"Most binding types also need a fourth property:\n\nConnection - Provides the name of an app setting key that contains the connection string. Bindings use connection strings stored in app settings to keep secrets out of the function code. Connection strings make your code more configurable and secure.",
    "137":"Improved Result Diversity: By giving higher scores to results that appear high in any of the combined rankings, Reciprocal Rank Fusion (RRF) reduces bias from single algorithms and increases the diversity and quality of search outcomes, ensuring more comprehensive results for users.",
    "264":"UI Component: Custom page (preview)\n\tA canvas based page which allows flexible layout, low-code Fx functions, and Power Apps connector data. For more information, see Model-driven app custom page overview (preview)",
    "177":"Event-Driven Architecture: Plug-ins operate on an event-driven architecture, meaning they are triggered by specific events within the Dataverse environment. These events can be actions like data creation, update, or deletion. Understanding the event model is crucial for effectively implementing and managing plug-ins.",
    "185":"Knowing how your report consumers are likely interacting with reports should influence your report designs. Consider the number of visuals that display together on the page, the complexity of visuals, spacing between visuals, and the use of interactive design elements such as tooltips, slicers, buttons, or filters.",
    "50":"If a change to one piece of data must result in a change to another piece of data, an application needs to group together a series of data updates. You can use transactions to group these updates. In a transaction, if one event in a series of updates fails, the entire series can be rolled back or undone.",
    "1":"Gaussian Process\nA probabilistic model for defining distributions over functions, often used in the context of continuous random noise. In diffusion, Gaussian processes model how noise is applied over time, treating noise at each step as a sample from a Gaussian distribution for simplicity.",
    "342":"Syntax for using the web api to get specific staff records based on a substring in the name column\n\nFActs_endpoint = \"ts_staffs?$filter=contains(ts_name, 'Manu')\"\nstaff_records = make_api_request(FActs_endpoint, method='Get')\n\nts_staffs: table name (pluralized)\nfilter=contains(ts_name, 'Manu'): filter on specific field based on containing a substring",
    "63":"Sectoral Diversity: Within the European Stoxx 600, there is a rich mix of sectors represented, including financial services, healthcare, industrials, technology, and consumer goods. This diversity not only mitigates investment risk but also offers investors comprehensive exposure to the varied economic sectors across Europe.",
    "36":"The capability to extend the default behavior of Microsoft Dataverse depends on detecting when events occur on the server. The Event Framework provides the capability to register custom code to be run in response to specific events.",
    "345":"Bindings are defined in JSON. A binding is configured in your function's configuration file, which is named function.json and lives in the same folder as your function code.\n\nLet's examine a sample input binding:\n\n    ...\n    {\n      \"name\": \"headshotBlob\",\n      \"type\": \"blob\",\n      \"path\": \"thumbnail-images\/{filename}\",\n      \"connection\": \"HeadshotStorageConnection\",\n      \"direction\": \"in\"\n    },\n    ...",
    "213":"When it comes to pre-trained models, TensorFlow Hub steps in with models that you can use right away, like ResNet and MobileNet. You can save time by using these models to recognize patterns or objects in images so you don’t have to start from scratch.",
    "21":"Compositional data refers to vectors of positive measurements which carry relative information, commonly analyzed in parts-per-whole relationships.",
    "207":"Each storage account requires some time and attention from an administrator to create and maintain. It also increases complexity for anyone who adds data to your cloud storage. Everyone in an administrator role needs to understand the purpose of each storage account so they add new data to the correct account.",
    "196":"You use the Microsoft 365 admin center to create user accounts for every user who needs access to apps, flows, or chatbots. The user account registers the user with Microsoft Online Services environment.",
    "108":"During sign-in, policies in report-only mode are evaluated but not enforced.\nResults are logged in the Conditional Access and Report-only tabs of the Sign-in log details.\nCustomers with an Azure Monitor subscription can monitor the impact of their Conditional Access policies using the Conditional Access insights workbook.",
    "91":"Storage mode: With storage mode, you can now specify which visuals require a query to back-end data sources. Visuals that don't require a query are imported even if they're based on DirectQuery. This feature helps improve performance and reduce back-end load. Previously, even simple visuals, such as slicers, initiated queries that were sent to back-end sources.",
    "355":"The Stable Diffusion model is a good starting point, and since its official launch, several improved versions have also been released. However, using a newer version doesn’t automatically mean you’ll get better results. You’ll still have to experiment with different checkpoints yourself, and do a little research (such as using negative prompts) to get the best results.",
    "200":"Latent Space\nA compressed, lower-dimensional representation of data where the model learns essential patterns. In image generation, the model manipulates data in this space, using encoded information to generate variations or enhance images, often leading to smoother, more computationally efficient results.",
    "45":"I had to use the os.path abspath function to get the absolute path of the file I created for the sake of sending it as an email attachment.\n  from os.path import abspath\n  ...\n  newmail.Attachments.Add(Source = abspath(relative_output_path))\n  newmail.Send()",
    "306":"Syntax for filtering a dataframe by a specific column, taking only the rows where that column value includes one of a set of substrings.\n\n# email_usernames = ['lauren.kawamoto', 'nicole.soon', 'darryl.nitta', 'yumi.ueda', 'ty.kubota']\nemail_pattern = \"|\".join(email_usernames)\ncy_user_df = user_df[user_df['internalemailaddress'].str.contains(email_pattern, case=False, na=False)]",
    "303":"Storage Efficiency: Vector compression reduces the size of high-dimensional vector embeddings, allowing Azure AI Search to store more vectors with less storage space. This optimization is crucial for handling large datasets efficiently.",
    "227":"Many popular machine learning algorithms and datasets are built into TensorFlow and are ready to use. In addition to the built-in datasets, you can access Google Research Datasets or use Google’s Dataset Search to find even more.",
    "182":"PyTorch is based on Torch, a framework for doing fast computation that is written in C. Torch has a Lua wrapper for constructing models.\n\nPyTorch wraps the same C back end in a Python interface. But it’s more than just a wrapper. Developers built it from the ground up to make models easy to write for Python programmers.",
    "265":"git push: This command uploads your local repository changes to a remote repository. It's used to share your changes with others.",
    "125":"In most cases, adding users to an environment only gives users access to the environment itself, not to any resources (apps and data) in the environment. You need to configure access to resources by assigning security roles to users.",
    "105":"Irregular but important business flows. Getting a new customer and onboarding that customer is an example where your code has a good reason to run. Such a flow likely consists of operations like interacting with a data store, sending out emails, and more.",
    "228":"The improved usage metrics report includes the following report pages:\n\nReport usage Provides information about report views and report viewers, such as how many users viewed the report by date.\nReport performance Shows the typical report opening times broken down by consumption method and browser types.\nFAQ Provides answers to frequently asked questions, such as What is a \"Viewer\" and what is a \"View\"?",
    "363":"safetensors are designed to be memory-mapped, allowing faster data loading, particularly when working with large models. This can improve performance, as only the necessary portions of data are loaded into memory rather than the entire file.",
    "135":"A normal distribution is mesokurtic, serving as a baseline with moderate tails and a kurtosis value of 0 (excess kurtosis) or 3 (raw kurtosis).",
    "113":"Azure Resource Groups provide a logical way to organize and manage resources within the Azure cloud. A resource group is a container that holds related resources for an Azure solution, such as virtual machines, storage accounts, and virtual networks.",
    "359":"The Windows SDK provides access to all of the APIs and development features exposed by the Windows OS. The Windows SDK is required for building Windows apps as well as other types of components (such as services and drivers). The latest Windows SDK is installed with Visual Studio 2019 and Visual Studio 2022 by default.",
    "149":"Workera.ai\nAzure Synapse Analytics: Comprehensive platform for integrating data warehousing and big data analytics with flexible resource options and extensive feature sets.",
    "230":"Structured Data Integration: \"Mappings\" define how source data fields are aligned with search index fields. Proper mappings ensure that data is correctly structured and accessible, facilitating efficient querying and accurate retrieval within Azure AI Search.",
    "124":"Sessions are used to persist parameters across requests. For example, if you want to use the same authentication across multiple requests, then you can use a session:\n\nimport requests\n\nTOKEN = \"<YOUR_GITHUB_PA_TOKEN>\"\n\nwith requests.Session() as session:\n    session.auth = TokenAuth(TOKEN)\n\n    first_response = session.get(\"https:\/\/api.github.com\/user\")\n    second_response = session.get(\"https:\/\/api.github.com\/user\")",
    "292":"Client - The client in an OAuth exchange is the application requesting access to a protected resource. The client could be a web app running on a server, a single-page web app running in a user's web browser, or a web API that calls another web API. You'll often see the client referred to as client application, application, or app.",
    "71":"Action\nActions in OData are operations that can perform modifications on the data, such as updating entities, triggering workflows, or processing business logic. Unlike functions, actions can alter the data or system state and are invoked through POST requests.",
    "218":"Comprehensive Data Enhancement: The enrichment pipeline can include various operations such as text extraction, translation, entity recognition, and sentiment analysis. These enhancements improve the quality and relevance of the indexed data, leading to better search outcomes.",
    "109":"Certain types of views aren't included in performance measurements. For example, when a user selects a link to a report in an email message, the Report View is accounted for in the report usage but there is no event in the performance metrics.",
    "206":"You can set a sandbox, production, or trial (subscription-based) environment in administration mode so that only users with System Administrator or System Customizer security roles will be able to sign in to that environment. Administration mode is useful when you want to make operational changes and not have regular users affect your work, and not have your work affect end users (non-admins).",
    "151":"Power BI and API Calls: Power BI supports REST API calls, allowing data import from web services. The built-in Web connector is used for API integration but primarily supports GET requests. More complex methods like POST require manual M code configuration to handle the request body and headers.",
    "8":"The flow_timeout_in_minutes parameter in Azure Virtual Network (VNet) controls how long a network flow (TCP\/UDP session) remains active when no data is being transferred. The value can range from 4 to 30 minutes, with 4 being the minimum, to prevent idle connections from being prematurely terminated.",
    "123":"Use content on SharePoint or OneDrive for Business for generative answers works by pairing your copilot with a URL, such as contoso.sharepoint.com\/sites\/policies. When a copilot user asks a question and the copilot doesn't have a topic to use for an answer, the copilot searches the URL and all sub-paths. For example, a URL such as contoso.sharepoint.com\/sites also includes subpaths like contoso.sharepoint.com\/sites\/policies.",
    "126":"Authorization server - The Microsoft identity platform is the authorization server. Also called an identity provider or IdP, it securely handles the end-user's information, their access, and the trust relationships between the parties in the auth flow. The authorization server issues the security tokens your apps and APIs use for granting, denying, or revoking access to resources (authorization) after the user has signed in (authenticated).",
    "346":"In an blob input binding definition:\n      \"path\": \"thumbnail-images\/{filename}\",\nProvide the path, which specifies the container and the item name that goes in it. The path property is required when using the blob trigger, and should be provided in the style shown here, with curly braces around the filename portion of the path. This syntax creates a binding expression that allows you to reference the blob's name in other bindings, and in your function's code.",
    "187":"Definition: A meta-package is a type of Python package that doesn't contain actual modules or libraries itself but is a collection of dependencies on other packages. It simplifies installation by grouping related packages under a single installable entity.",
    "127":"The locale.setlocale() function is used to set the locale explicitly in your code, while the locale.currency() function formats currency values according to the specified locale.",
    "361":"safetensors is an alternative file format developed for securely and efficiently storing large deep learning model weights, especially for use in frameworks like PyTorch. Here are its key benefits:",
    "129":"You can use Azure AI Studio to build a custom copilot that uses your own data to ground prompts. Azure AI Studio supports a range of data connections that you can use to add data to a project, including:\n\nAzure Blob Storage\nAzure Data Lake Storage Gen2\nMicrosoft OneLake\nYou can also upload files or folders to the storage used by your AI Studio project.",
    "67":"The common practice is to use lists for homogeneous objects and tuples for heterogeneous objects. Lists are typically used when all elements are of the same type, while tuples are used when elements are of different types.",
    "16":"Fokker-Planck Equation\nA differential equation describing the time evolution of probability distributions in diffusion processes. It provides a mathematical basis for understanding how probabilities spread over time in continuous diffusion, modeling how noise transforms an image’s data distribution.",
    "329":"Temporary profile\t\nA fail-safe profile is created when a user's roaming profile has problems loading. It's discarded at sign-out.",
    "186":"execute_script (Selenium):\nexecute_script is a Selenium method that allows you to execute raw JavaScript code within the browser being controlled. It’s often used to retrieve hidden variables or perform actions not directly available through Selenium commands.",
    "90":"• DNS Filtering and Security Policies:\nAdvanced configurations and rules applied at the DNS level to enforce security policies, including blocking or redirecting traffic to prevent access to unauthorized or malicious sites.",
    "222":"a single audit is more specialized and focused on compliance with federal funding, while an audit by a public accounting firm is more comprehensive and focused on the overall financial health and reporting of an entity.",
    "52":"Authentication scenarios involve two activities:\n\nAcquiring security tokens for a protected web API: We recommend that you use the Microsoft Authentication Library (MSAL), developed and supported by Microsoft.\nProtecting a web API or a web app: One challenge of protecting these resources is validating the security token. On some platforms, Microsoft offers middleware libraries.",
    "25":"In Python’s unittest package, you can use fixtures to set up and tear down test environments for each test method. To do this, you can use the setUp() and tearDown() method, respectively. These methods are automatically called before and after each test method.",
    "115":"$expand\nDefinition: An OData query option that allows retrieving related data in a single query by expanding related entities.\nRelevance: The $expand option is highly useful when you need to retrieve related data (e.g., including a parent entity's information in the same query). It reduces the number of separate API calls required to retrieve related data, optimizing performance.",
    "31":"The SUMMARIZE function in DAX is a powerful function used to create summary tables or groupings of data based on specified columns and expressions. It essentially performs a GROUP BY operation similar to SQL.",
    "272":"More coding languages are supported in TensorFlow than in PyTorch, which has a C++ API. You can use TensorFlow in both JavaScript and Swift. If you don’t want to write much low-level code, then Keras abstracts away a lot of the details for common use cases so you can build TensorFlow models without sweating the details.",
    "178":"It is possible and recommended to search the hyper-parameter space for the best cross validation score.\n\nAny parameter provided when constructing an estimator may be optimized in this manner. Specifically, to find the names and current values for all parameters for a given estimator, use:\n\nestimator.get_params()",
    "158":"Azure HDInsight: Suitable for diverse big data processing needs with open-source frameworks but requires infrastructure management.",
    "5":"The CRUD operations correspond almost one-to-one with SQL commands:\n\nCreate: INSERT\nRead: SELECT\nUpdate: UPDATE\nDelete: DELETE\nSo, to modify existing data in SQL, you would use the UPDATE command.",
    "356":"Developer Mode replaces the Windows 8.1 requirements for a developer license. In addition to sideloading, the Developer Mode setting enables debugging and additional deployment options. This includes starting an SSH service to allow deployment to this device. In order to stop this service, you need to disable Developer Mode.",
    "202":"The simplest way to use cross-validation is to call the cross_val_score helper function on the estimator and the dataset.\n\nfrom sklearn.model_selection import cross_val_score\nclf = svm.SVC(kernel='linear', C=1, random_state=42)\nscores = cross_val_score(clf, X, y, cv=5)\nscores",
    "77":"• DNS Forwarding:\nThe process of forwarding DNS queries from one DNS server to another, often used in corporate networks to ensure that all DNS traffic passes through a specific DNS server.",
    "10":"Score-based Models\nA type of diffusion model that estimates a \"score\" or gradient, representing how much to adjust each pixel to reduce noise. These models iteratively improve an image by minimizing the noise, guided by a score function that optimizes image coherence.",
    "332":"Magic methods, also known as special methods or dunder methods, are methods in Python whose names start and end with a double underscore.\n\nThese methods have special meanings and are automatically called by Python in response to certain operations, such as instantiation, sequence indexing, and attribute management.",
    "57":"Find more information about the problem by clicking More Details in the initial error page. Clicking More Details will reveal troubleshooting information that's helpful when searching the Microsoft Entra sign-in events for the specific failure event the user saw or when opening a support incident with Microsoft.\nStuff like App name, App id, IP address, Device identifier, Device Platform,",
    "327":"Form Data in HTTP Requests:\nA method of sending key-value pairs through HTTP requests, typically used when submitting form-like data. In JSON-based APIs, form data is less common, with JSON payloads being the standard.",
    "316":"git init: This command initializes a new Git repository in your current directory. It creates a hidden .git directory that tracks all changes to your project.",
    "15":"Azure AI Search (formerly known as \"Azure Cognitive Search\") provides secure information retrieval at scale over user-owned content in traditional and conversational search applications.",
    "334":"Likelihood Estimation\nThe process of calculating the probability of the data under the model's parameters. In diffusion models, maximizing this likelihood means finding parameters that make the observed data most probable, allowing for a better approximation of complex data distributions.",
    "39":"I figured out how to export the sign-in logs! I need to create a diagnostic setting from the sign in log page in the Entra admin center and point it at an azure log analytics resource. It looks like there was about a 5 minute delay.",
    "143":"Assuming that some data is Independent and Identically Distributed (i.i.d.) is making the assumption that all samples stem from the same generative process and that the generative process is assumed to have no memory of past generated samples.",
    "330":"The classes in sklearn.neighbors can handle either NumPy arrays or scipy.sparse matrices as input. For dense matrices, a large number of possible distance metrics are supported. For sparse matrices, arbitrary Minkowski metrics are supported for searches.",
    "189":"Transactional databases are often called online transaction processing (OLTP) systems. OLTP systems commonly support many users, have quick response times, and handle large volumes of data. They also are highly available, which means they have minimal downtime. OLTP systems typically handle small transactions or relatively simple transactions.\nAn example of an Azure service that supports OLTP is Azure SQL Database.",
    "47":"Workflow in the context of Microsoft Dataverse and Power Apps refers to the automation of business processes and tasks. Workflows are a series of steps and rules that define how data is processed and managed within the system. Workflows can be triggered by events such as record creation, update, or deletion, and can perform actions like sending emails, updating records, creating tasks, and more.",
    "211":".headers returns a dictionary-like object, allowing you to access header values by key. For example, to see the content type of the response payload, you can access \"Content-Type\":\n\n>>> response.headers[\"Content-Type\"]\n'application\/json; charset=utf-8'\n\nThere’s something special about this dictionary-like headers object, though. The HTTP specification defines headers as case-insensitive, which means that you’re able to access these headers without worrying about their capitalization:",
    "308":"In a Python Template string, placeholders consist of two parts: a dollar sign ($) followed by a valid Python identifier. This is different from other string interpolation methods that might use curly braces or percentage symbols. Valid identifiers are those that can be used as variable names in Python, which include letters, underscores, and digits but can’t start with a digit or be a Python keyword.",
    "338":"The configuration files for a dev container are contained in a .devcontainer directory in your repository. You can use Visual Studio Code to add configuration files for you. You can choose from a selection of predefined configurations for various project types",
    "183":"Maintenance: Meta-packages need to be maintained just like any other package. They should be updated to point to the latest, stable releases of their dependencies. If not properly maintained, they might pin outdated versions or lead to dependency conflicts.",
    "269":"RandomizedSearchCV implements a randomized search over parameters, where each setting is sampled from a distribution over possible parameter values. This has two main benefits over an exhaustive search:\nA budget can be chosen independent of the number of parameters and possible values.\nAdding parameters that do not influence the performance does not decrease efficiency.",
    "19":"Note: Requests uses a package called certifi to provide certificate authorities. This lets Requests know which authorities it can trust. Therefore, you should update certifi frequently to keep your connections as secure as possible.",
    "243":"_ts_engagementid_value@Microsoft.Dynamics.CRM.lookuplogicalname\nDefinition: A field that contains the logical name of the entity that the lookup field points to. This helps identify the type of entity related to the GUID in the _ts_engagementid_value field.\nExample: The value \"ts_engagement\" indicates that the lookup points to the ts_engagement entity.",
    "148":"The cv_results_ attribute contains useful information for analyzing the results of a search. It can be converted to a pandas dataframe with df = pd.DataFrame(est.cv_results_). The cv_results_ attribute of HalvingGridSearchCV and HalvingRandomSearchCV is similar to that of GridSearchCV and RandomizedSearchCV, with additional information related to the successive halving process.",
    "232":"git pull: This command fetches and integrates changes from a remote repository into your local repository. It's a combination of git fetch and git merge.",
    "240":"Resource owner - The resource owner in an auth flow is usually the application user, or end-user in OAuth terminology. The end-user \"owns\" the protected resource (their data) which your app accesses on their behalf. The resources owners can grant or deny your app (the client) access to the resources they own. For example, your app might call an external system's API to get a user's email address from their profile on that system.",
    "165":"The parties in an authentication flow use bearer tokens to assure, verify, and authenticate a principal (user, host, or service) and to grant or deny access to protected resources (authorization). Bearer tokens in the Microsoft identity platform are formatted as JSON Web Tokens (JWT).",
    "314":"A Hyperparameter search consists of:\n\n    an estimator (regressor or classifier such as sklearn.svm.SVC());\n    a parameter space;\n    a method for searching or sampling candidates;\n    a cross-validation scheme; and\n    a score function.",
    "76":"Logical Name (Entity):\nThe system name used to refer to an entity in Dynamics 365. It is different from the display name and is used when interacting with the API, such as in @odata.bind syntax for lookups.",
    "141":"Moving Average Plots\nTo see what kind of trend a time series might have, we can use a moving average plot. To compute a moving average of a time series, we compute the average of the values within a sliding window of some defined width. The idea is to smooth out any short-term fluctuations in the series so that only long-term changes remain.",
    "245":"URIs for certain apps:\n○ Apps that use embedded browsers: https:\/\/login.microsoft.com\/common\/oauth2\/nativeclient (Note: if your app would pop up a window which typically contains no address bar, it is using the \"embedded browser\")\nApps that would use system browsers: http:\/\/loclahost (Note: If your app would bring your system's default browser (such as edge, chrome, firefox, and so on) to visit Microsoft login portal, it is using the \"system browser\".)",
    "40":"git status: This command shows the current state of your working directory and staging area. It helps you see which changes have been staged, which haven't, and which files aren't being tracked by Git.",
    "295":"Handling Empty Lists and Missing Data in explode: The explode method gracefully handles empty lists and missing values (NaN) when you use DataFrame.explode. Empty lists result in no additional rows, while NaN values are propagated, ensuring DataFrame consistency after the operation.",
    "128":"Automatic VM guest patching: This refers to the automated process of updating the operating system of virtual machines hosted on Azure to ensure security and compliance with the latest patches.",
    "253":"The issue was an attempt to install the deprecated azure meta-package, which is no longer supported. The resolution involved installing the azure-functions package specifically for Python Azure Functions, enabling the successful setup and execution of the Azure Functions Python application.",
    "231":"Two arrays are broadcast compatible if their rightmost dimensions are identical, or either of these dimensions is 1. Once your arrays are broadcast compatible, you can use them together with the where() function.",
    "95":"In mathematics, a manifold is a topological space that locally resembles Euclidean space near each point. More precisely, an n-dimensional manifold, or n-manifold for short, is a topological space with the property that each point has a neighborhood that is homeomorphic to an open subset of n-dimensional Euclidean space.",
    "96":"import re\n\ndef replace_punctuations_and_spaces(input_string):\n    # Define the pattern to match all punctuations and spaces\n    pattern = r'[^\\w]'\n    # Replace all matched characters with an empty string\n    result = re.sub(pattern, '', input_string)\n    return result",
    "237":"Token Renewal: Refresh tokens are used to obtain new access and refresh token pairs when the current access token expires.\nToken Lifetime: The default lifetime for refresh tokens is 24 hours for single-page applications and 90 days for other scenarios.",
    "167":"Unconfigurable Attribute Error\nThis Terraform error occurs when you try to manually set an attribute that Terraform automatically manages, such as an id for subnets. Terraform expects such attributes to be generated dynamically during resource creation, and manually setting them can result in conflicts between the configuration and the actual state.",
    "336":"Diffusion Model\nA generative model that gradually converts random noise into an image by iteratively refining it through multiple steps, guided by trained patterns learned from data. This is achieved through a process that \"diffuses\" image details from a noise-laden starting point to a coherent output.",
    "97":"You would typically use np.where() when you have an array and need to analyze its elements differently depending on their values. For example, you might need to replace negative numbers with zeros or replace missing values such as None or np.nan with something more meaningful. When you run where(), you’ll produce a new array containing the results of your analysis.",
    "290":"• Domain Spoofing:\nThe act of falsifying DNS records or domain names to make one domain appear as another, often used in phishing or other deceptive practices.",
    "46":"NearestNeighbors implements unsupervised nearest neighbors learning. It acts as a uniform interface to three different nearest neighbors algorithms: BallTree, KDTree, and a brute-force algorithm based on routines in sklearn.metrics.pairwise.",
    "111":"When you create a user and assign a license in the Microsoft 365 admin center, the user is also created in customer engagement apps. It can take a few minutes to complete the synchronization process between the Microsoft 365 admin center and customer engagement apps.",
    "7":"KL Divergence\nA measure of difference between two probability distributions. In diffusion models, KL divergence is used to align the generated distribution with the true data distribution, encouraging the model to produce more realistic samples by minimizing the divergence in the reverse process.",
    "360":"The Windows App SDK was previously known by the code name Project Reunion. Some SDK assets (such as the VSIX extension and certain NuGet packages) still use this name, but these assets will be renamed in a future release. Some documentation still uses Project Reunion when referring to an existing asset or a specified earlier release.",
    "166":"Variational Inference\nA technique for approximating complex probability distributions by simpler ones. In diffusion models, variational inference approximates the posterior distribution of the reverse process, enabling computationally feasible training by simplifying the diffusion and denoising steps.",
    "278":"Optimistic Concurrency\nDefinition: A method of ensuring that data integrity is maintained when multiple users or processes are updating the same record. It checks if the record has been modified since it was last retrieved before allowing updates.\nRelevance: This is useful for preventing conflicts in multi-user environments. The Web API uses the If-Match header to implement this mechanism, ensuring that updates happen only if the record has not been altered by another process.",
    "331":"3. We secured our function against unknown HTTP callers by requiring a function-specific API key be passed with each call. Which of the following fields is the header name in the HTTP requests that needs to contain this key? \n\nx-functions-key\nThe API key can be included as a query string parameter named code, or as an HTTP header named x-functions-key.",
    "174":"Energy-Based Models (EBMs)\nA framework where probability distributions are modeled as energy functions, allowing the model to assign lower energy to more realistic data samples. Diffusion models leverage EBMs to learn a smoother denoising process by associating lower energy states with cleaner images.",
    "73":"Reverse Diffusion\nThe inverse process where an image is generated by removing noise, step-by-step, from an initial noisy state. This approach is essential in diffusion models, reconstructing data by \"reversing\" the diffusion process and achieving high-quality image outputs.",
    "225":"Thread\nA conversation session between an Assistant and a user. Threads store Messages and automatically handle truncation to fit content into a model's context.",
    "38":"When a request fails, you may want your application to retry the same request. However, Requests won’t do this for you by default. To apply this functionality, you need to implement a custom transport adapter.\n\nTransport adapters let you define a set of configurations for each service that you’re interacting with.",
    "257":"There are three main components of the library to know about:\nMany different schedulers - algorithms that control how noise is added for training, and how to generate denoised images during inference.",
    "23":"The load_tests() function in Python’s unittest framework is a hook for customizing test loading and suite creation. It takes three arguments: a test loader, a series of tests, and a test discovery pattern. When you call unittest.main(), load_tests() gets called automatically.",
    "159":"Power Platform services are built on Azure, Microsoft's cloud computing platform. The Power Platform service architecture is composed of four components:\n\nWeb front-end cluster\nBack-end cluster\nPremium infrastructure\nMobile platforms",
    "319":"Edm (Entity Data Model)\nThe Entity Data Model (Edm) is a core concept in OData. It defines the structure of data exposed by an OData service, including entity types, relationships, and properties. Edm is used to describe the schema of the data and how entities relate to one another.",
    "49":"Advanced Semantic Representations: Text-embedding-3 models convert textual data into dense vector representations, capturing the contextual and semantic nuances of the content. This enables Azure AI Search to perform more sophisticated semantic searches.",
    "133":"Just like the other triggers we've seen so far, you can create a blob trigger in the Azure portal. Inside your Azure function, select Blob trigger from the list of predefined trigger types. Then, enter the logic that you want to execute when a blob is created or updated.\n\nOne setting that's important to understand is the Path. The Path tells the blob trigger which blob container to monitor to see if a blob is uploaded or updated. By default, the Path value is:\n\nsamples-workitems\/{name}",
    "155":"Azure IoT Hub\nPurpose and Use Cases:\n\nCore IoT Service: Azure IoT Hub is a foundational service designed to provide the connectivity and messaging infrastructure required for building sophisticated IoT solutions.\nCustomization: It's ideal for developers who need a highly customizable solution and have the expertise to build and manage the IoT application layer themselves.",
    "81":"Stochastic Differential Equations (SDEs)\nThese equations describe how noise evolves over continuous time in diffusion models. By defining the noise dynamics, SDEs allow for modeling both forward (adding noise) and reverse (removing noise) processes as smooth, differential transformations.",
    "242":"Mainframe-as-a-Service (MFaaS) is a subscription-based model that addresses the challenges of an aging mainframe while providing flexibility and scalability for future growth. MFaaS is hosted at a provider’s data center or partners’, offering a cloud-like experience.",
    "261":"The graph output uses the DOT language, which is a machine-readable graph description language which originated in Graphviz. You can use the Graphviz dot command to present the resulting graph description as an image. There are also various third-party online graph rendering services which accept this format.",
    "104":"The response headers can give you useful information, such as the content type of the response payload and a time limit on how long to cache the response. To view these headers, access .headers:\n\n>>> import requests\n\n>>> response = requests.get(\"https:\/\/api.github.com\")\n>>> response.headers\n{'Server': 'GitHub.com',\n...\n'X-GitHub-Request-Id': 'AE83:3F40:2151C46:438A840:65C38178'}",
    "326":"ELBO (Evidence Lower Bound)\nA loss function that diffusion models optimize to maximize the likelihood of generating realistic data. ELBO breaks down the generative process into manageable steps, penalizing differences between real and generated data distributions, balancing reconstruction quality and computational efficiency.",
    "58":"If you invoke Response.raise_for_status(), then Requests will raise an HTTPError for status codes between 400 and 600. If the status code indicates a successful request, then the program will proceed without raising that exception.",
    "311":"We recommend setting up continuous deployment so that your function app in Azure is updated when you update source files in the connected source location. You can also deploy your project files from Visual Studio Code. When you publish from Visual Studio Code, you can take advantage of the Zip deploy technology.",
    "262":"Enhanced Semantic Embeddings: By leveraging Matryoshka Representation Learning (MRL), Azure AI Search generates more nuanced semantic embeddings. These embeddings facilitate better context recognition and relevance in search results, leading to more accurate and meaningful information retrieval.",
    "282":"Detailed Diagnostic Insights: Debug Sessions offer access to logs and diagnostic information, enabling the detection of problems such as incorrect data mappings, skill misconfigurations, or performance bottlenecks, thereby improving the overall reliability of the search solution.",
    "161":"Authentication helps a service understand who you are. Typically, you provide your credentials to a server by passing data through the Authorization header or a custom header defined by the service. All the functions of Requests that you’ve seen to this point provide a parameter called auth, which allows you to pass your credentials:\n\n>>> import requests\n\n>>> response = requests.get(\n...     \"https:\/\/httpbin.org\/basic-auth\/user\/passwd\",\n...     auth=(\"user\", \"passwd\")\n... )",
    "152":"lib-geo-selector \/ Custom HTML Tags:\nIn Angular and similar frameworks, custom HTML tags like <lib-geo-selector> are used to represent components with built-in functionality. These tags can be harder to scrape since they aren't standard HTML elements like <select> or <table>.",
    "102":"Public Client:\n\nDefinition: An application type in OAuth2 that does not require a client secret because it runs on devices that cannot securely store credentials (like mobile or desktop apps).\nContext: We configured your app as a public client so it could authenticate without a client secret",
    "181":"Python fully supports arithmetic between ints and floats. It will convert narrower numbers to match their less narrow counterparts when used with the binary arithmetic operators (+, -, *, \/, \/\/, and %). When division with \/, \/\/ returns the quotient and % returns the remainder. Python considers ints narrower than floats. So, using a float in an expression ensures the result will be a float too. However, when doing division, the result will always be a float, even if only integers are used.",
    "60":"When making the role acc_caseUser, I was having trouble making sure that the users were correctly inheriting the role from the teams I assigned them to. This can be checked by looking at one of the records you're checking access to in the GUI, then choosing (...) > Check access > Pick the desired user",
    "291":"Forward and Reverse Processes\nIn diffusion, the forward process gradually adds noise to data, following a fixed probabilistic schedule, and the reverse process learns to denoise the noisy data. Mathematically, the forward process models q(x_t | x_{t-1}), while the reverse learns p(x_{t-1} | x_t) to reconstruct images.",
    "216":"Custom Components (Angular):\nCustom components are reusable blocks of code in frameworks like Angular that define new HTML elements. They encapsulate logic, styling, and behavior, making it difficult to scrape using traditional methods like targeting <table> or <div> tags.",
    "349":"Input bindings allow you to connect your function to a data source. You can connect to several types of data sources, and the parameters for each vary. To resolve values from input sources, use binding expressions in the function.json file, in function parameters, or in code.",
    "293":"ShuffleSplit: ShuffleSplit randomly splits the data multiple times into training and test sets, allowing control over the number of splits, training\/test set sizes, and randomization. It’s versatile and works well for datasets with no inherent ordering or stratification needs.",
    "212":"Sideloading involves installing apps on a device using methods other than official app stores, often for accessing region-restricted apps or testing development versions.",
    "122":"If your organization is using Azure Private Link in Power BI, because client-telemetry is not available the usage metrics reports will only contain Report Open events.",
    "258":"AI-Powered Data Enrichment: \"Skills\" in Azure AI Search refer to AI functions that enhance and transform data during indexing, such as entity recognition, language detection, and sentiment analysis. These skills enrich the data to improve search relevance.",
    "284":"Run\nActivation of an Assistant to begin running based on the contents of the Thread.\n\nRun Step\nA detailed list of steps the Assistant took as part of a Run. An Assistant can call tools or create messages during its run. Examining Run Steps allows you to understand how the Assistant is getting to its final results.",
    "217":"Assistants API supports persistent automatically managed threads. This means that as a developer you no longer need to develop conversation state management systems and work around a model’s context window constraints. The Assistants API will automatically handle the optimizations to keep the thread below the max context window of your chosen model.",
    "193":"To support offline use, Power Apps allows data to be cached locally on the device. Users can create, update, and delete records while offline, and these changes are synchronized with the Dataverse database once the device reconnects to the internet. This must all be configured ahead of time.",
    "144":"Assistants can access files in several formats. Either as part of their creation or as part of Threads between Assistants and users. When using tools, Assistants can also create files (such as images or spreadsheets) and cite files they reference in the Messages they create.",
    "80":"Metadata Document\nIn OData, the metadata document describes the structure of the OData service, including the entity types, relationships, and properties. It is expressed in an XML format and allows developers and tools to understand the underlying schema of the OData service for integration purposes.",
    "132":"Trigger types and purpose:\nEvent Hub: Execute a function when an event hub receives a new event\nEvent Grid:\tExecute a function based on Event Grid subscriptions",
    "160":"TorchText is part of the PyTorch ecosystem and is designed to handle text data for natural language processing tasks. It offers tools for managing data loading, applying text transformations, and integrating with datasets.\n\nThis library simplifies tasks like text classification and language modeling by making vocabulary creation and tokenization more straightforward.",
    "55":"• DNS Interception:\nThe DNS Interception feature intercepts and replaces DNS queries matching the configured patterns. You can also allow-list domains. Allow-listed domains always take precedence over the DNS Interception policies. Subdomains of intercepted domains must be explicitly added. They are not intercepted automatically. You must run a caching DNS server to use DNS interception.",
    "223":"Given enough time, K-means will always converge, however this may be to a local minimum. This is highly dependent on the initialization of the centroids. As a result, the computation is often done several times, with different initializations of the centroids. One method to help address this issue is the k-means++ initialization scheme, which has been implemented in scikit-learn (use the init='k-means++' parameter).",
    "169":"TimeSeriesSplit: TimeSeriesSplit performs cross-validation on time series data, keeping temporal ordering intact by using only past data to predict future data in each fold. It’s designed for forecasting, where future information should not be included in training.",
    "107":"• Split-Horizon DNS:\nA DNS configuration where different responses are given to queries depending on the source of the query (e.g., internal vs. external network users).",
    "238":"• DNS Amplification Attack:\nA type of DDoS attack that exploits DNS servers by sending small queries with spoofed IP addresses, leading to large responses that overwhelm the target.",
    "51":"• DNS Server:\nA server that resolves domain names into IP addresses. Examples include Cloudflare's 1.1.1.1 or Google's 8.8.8.8.",
    "350":"Schedulers manage going from a noisy sample to a less noisy sample given the model output - in this case, it is the noisy_residual.",
    "300":"Online analytical processing (OLAP) systems commonly support fewer users, have longer response times, can be less available, and typically handle large transactions or complex transactions.\nAn example of an Azure service that supports OLAP is Azure Analysis Services.",
    "85":"Azure Resource Providers are essentially services within the Azure ecosystem that manage specific types of Azure resources. When you interact with Azure, whether through the Azure Portal, Azure CLI, Azure PowerShell, REST APIs, or SDKs, you're often dealing with these resources. Each resource provider specializes in a particular category of resources, such as virtual machines, storage accounts, databases, etc.",
    "275":"Sideloading benefits include testing new app features, deploying custom enterprise apps, and accessing legacy applications critical to business operations, despite not being available in app stores.",
    "267":"Every Azure Function must have exactly one trigger associated with it. If you want to use multiple triggers, you must create multiple functions.",
    "274":"Trigger\nA trigger is set up to tell the pipeline when to run. You can configure a pipeline to run upon a push to a repository at scheduled times or upon completing another build. All these actions are known as triggers.",
    "100":"A storage account represents a collection of settings like location, replication strategy, and subscription owner. You need one storage account for each group of settings that you want to apply to your data. The following illustration shows two storage accounts that differ in one setting (region); that one difference is enough to require separate storage accounts.",
    "244":"There are three main components of the library to know about:\nPopular pretrained model architectures and modules that can be used as building blocks for creating diffusion systems.",
    "147":"Bearer Token:\n\nDefinition: A type of token used in OAuth2 that authorizes access to resources like APIs.\nContext: The token obtained from Azure AD that you include in the Authorization header for your API requests.",
    "99":"With TensorFlow’s TF Image, part of TensorFlow’s core, you get all the basics for resizing, cropping, and flipping images to get them ready for your models. Then there’s TensorFlow Datasets (TFDS), which offers a huge selection of real-world image datasets that are easy to plug into your projects.",
    "145":"API Management\tAPIM provides security and routing for your HTTP triggered function endpoints as a way to expose them as a true REST API.",
    "72":"The Dual storage mode is a performance optimization. It should be used only in ways that don't compromise the ability to meet business requirements. For alternative behavior, consider using the techniques described in the Many-to-many relationships in Power BI Desktop.",
    "112":"Handling Optional API Parameters: For more advanced API requests, parameters such as catalog, calculations, annual averages, and aspects can be added in the payload. These allow for more control over the data returned. Adding these parameters will depend on the API’s available options as per its documentation.",
    "20":"Power BI Web Connector Limitation: The \"From Web\" connector supports only GET requests by default. To use POST requests or include a body\/payload in the request, you must manually edit the Power Query M code. The connector does not provide an interface for specifying request types or payloads in the UI.",
    "343":"Three properties are required in all bindings, though you might have to supply more properties based on the type of binding and storage you're using.\n\nName - Defines the function parameter through which you access the data. For example, in a queue input binding, this property is the name of the function parameter that receives the queue message content.\nType - Identifies the type of binding. For example, the type of data or service you want to interact with.\nDirection - Indicates the direction data is flowing. For example, is it an input or output binding?",
    "118":"Unconditional Image Generation: Generate an image from Gaussian noise\n    Pipeline: unconditional_image_generation \nText-Guided Image Generation: Generate an image given a text prompt\n    Pipeline: conditional_image_generation",
    "92":"Annealed Langevin Dynamics\nA method used for image generation where noise is gradually reduced while applying denoising steps. Mathematically, it involves adjusting noise strength in each step to maintain a balance between randomness and data fidelity, aiding high-quality sampling in diffusion.",
    "208":"MSAL (Microsoft Authentication Library):\n\nDefinition: A Microsoft library for handling authentication and obtaining tokens using OAuth2. It simplifies the process of integrating OAuth2 with applications.\nContext: We used MSAL in Python to implement the Device Code Flow and authenticate interactively with MFA.",
    "18":"Confidential client applications: Apps in this category include:\n\nWeb apps that call a web API\nWeb APIs that call a web API\nDaemon apps, even when implemented as a console service like a Linux daemon or a Windows service",
    "210":"If your desktop or mobile application runs on Windows and on a machine connected to a Windows domain (Active Directory or Microsoft Entra joined) it is possible to use the Integrated Windows Authentication (IWA) to acquire a token silently. No UI is required when using the application.",
    "246":"Bindings comes in two flavors, input, and output. Input bindings can be used to pass data to your function from a data source different than the one that triggered the function.",
    "163":"In Python, special methods support comparison operators.\n\nFor example, the .__lt__() method supports the < operator, .__gt__() supports >, and the .__eq__() method supports the == operator.\n\nThese methods allow you to define custom behavior for comparison operations in your custom classes.",
    "168":"on 9\/30, when I was trying to upload a report for HEC, I was noticing that Power BI seemed to go unresponsive and not publish. It turned out that I could publish if I switched from the corp network to the guest network. Why this works is a mystery.",
    "114":"2\nMS Data Analyst\nTo learn how to run a network port test, see Adjust communication settings for the on-premises data gateway.\nTo get information on how to provide proxy information for your gateway, see Configure proxy settings for the on-premises data gateway.\nTo find the current data center region that you're in, see Set the data center region.",
    "70":"In Python, you can compare sequences of the same type. When comparing two sequences, the first \nnon-equal\n value determines the outcome.\n\nFor example, consider the following lists:\n\nnumbers = [1, 2, 3, 4, 5]\nmore_numbers = [1, 2, 2, 10, 20]\nWhen you compare these lists, you’ll find that numbers is greater than more_numbers.",
    "321":"Look up relevant information\nThis is a node in the sample RAG Prompt flow. you use the Index Lookup tool to query the search index you created with the integrated Azure AI Search feature and find the relevant information from your data source.",
    "117":"To create an iterator in Python, you need to implement .__iter__() and .__next__().\n\nThe .__iter__() special method initializes the iterator and must return an iterator object, typically self.\n\nThe .__next__() method retrieves the next value in the data stream and must raise a StopIteration exception when the data stream is exhausted.",
    "59":"Conditional Access: Client certificates can be used in conditional access policies to control access based on device compliance. This adds an extra layer of security by ensuring that only compliant devices can access sensitive data.",
    "131":"To make a class iterable, you need to define the .__iter__() special method in the class. This method must return an iterator, which Python uses in its iteration protocol.",
    "271":"Code to query engagement task table for tasks that belong to a specific engagement based on that engagement's engagement id. Note the underscores and _value suffix to indicate that the field we're looking up will be a GUID.\n\nendpoint_tasks = \"ts_engagementtasks?$filter=_ts_engagementid_value eq '9054359c-9270-40c8-8fcf-xxxxxxxxxxxx'\"\ngui_made_tasks = make_api_request(endpoint=endpoint_tasks, method='GET')",
    "136":"Exploding Multiple Columns using explode: Starting from pandas version 1.3.0, DataFrame.explode allows you to explode multiple columns simultaneously by passing a list of column names to explode. This is useful when you have multiple list-like columns that need to be expanded in parallel.",
    "255":"According to the HTTP specification, POST, PUT, and the less common PATCH requests pass their data through the message body rather than through parameters in the query string. Using Requests, you’ll pass the payload to the corresponding function’s data parameter.\n\ndata takes a dictionary, a list of tuples, bytes, or a file-like object.",
    "328":"Use the auth code flow paired with Proof Key for Code Exchange (PKCE) and OpenID Connect (OIDC) to get access tokens and ID tokens in these types of apps:\n\nSingle-page web application (SPA)\nStandard (server-based) web application\nDesktop and mobile apps",
    "53":"Service Document\nThe service document is the entry point for an OData service. It provides metadata about the available entity sets and other resources that the client can interact with. The document acts as a map, allowing the client to discover what data is exposed via the OData service.",
    "358":"When you enable Developer Mode on desktop, a package of features is installed, including:\n\nWindows Device Portal: Device Portal is only enabled (and firewall rules are only configured for it) when the Enable Device Portal option is turned on.\nInstalls and configures firewall rules for SSH services that allow remote installation of apps. Enabling Device Discovery will turn on the SSH server.",
    "88":"To learn who the user is before redeeming an authorization code, it's common for applications to also request an ID token when they request the authorization code. This approach is called the hybrid flow because it mixes OIDC with the OAuth2 authorization code flow.",
    "89":"git stash: This command temporarily saves changes in your working directory that you aren't ready to commit. You can later apply or discard these changes.",
    "256":"JSON null:\nThe JSON equivalent of Python's None, used to represent missing or undefined data. It’s essential to replace invalid values like NaN with null in JSON payloads to avoid request errors.",
    "28":"OAuth versus OpenID Connect: The platform uses OAuth for authorization and OpenID Connect (OIDC) for authentication. OpenID Connect is built on top of OAuth 2.0, so the terminology and flow are similar between the two. You can even both authenticate a user (through OpenID Connect) and get authorization to access a protected resource that the user owns (through OAuth 2.0) in one request.",
    "198":"When evaluating the resulting model it is important to do it on held-out samples that were not seen during the grid search process: it is recommended to split the data into a development set (to be fed to the GridSearchCV instance) and an evaluation set to compute performance metrics.",
    "263":"Score Matching\nA method to train models by estimating the gradient of data probability density (the \"score\") at each noise level. By approximating this gradient, the model learns to shift noisy data towards regions of higher probability, ultimately leading to denoised, realistic images.",
    "116":"Error Handling and Performance with json_normalize: Using the errors parameter in json_normalize, you can manage parsing errors with options like 'raise' or 'ignore'. Efficient handling of large JSON datasets with json_normalize improves performance, making it valuable for big data applications.",
    "41":"Running pip install within a Jupyter notebook is straightforward: you prefix the command with an exclamation mark (!). This tells the notebook to execute the command as a shell command rather than Python code. For example:\n\npython\n!pip install ipywidgets\n\nAfter installing, remember to restart the kernel to ensure the notebook recognizes the new packages.",
    "139":"When you make a request, the Requests library prepares the request before actually sending it to the destination server. Request preparation includes things like validating headers and serializing JSON content.\n\nYou can view the PreparedRequest object by accessing .request on a Response object:",
    "353":"The Scripts\\ folder contains the pip executable. If there’s any issue in the way Path variables are processed (which can occasionally happen if multiple Python versions are installed), running python -m pip ensures the right pip is used with the right Python version.",
    "13":"Add the flag --validate to keep the Azure CLI command (Bash!) to keep from actually deploying.",
    "224":"git log: This command shows the commit history for the repository. It helps you see what changes were made, when, and by whom.",
    "279":"Text-Guided Depth-to-Image Translation: adapt parts of an image guided by a text prompt while preserving structure via depth estimation\n    pipeline: depth2img\n\nStart by creating an instance of a DiffusionPipeline and specify which pipeline checkpoint you would like to download.",
    "268":"Text-Guided Image-to-Image Translation: Adapt an image guided by a text prompt\n    Pipeline: img2img\nText-Guided Image-Inpainting: Fill the masked part of an image given the image, the mask, and a text prompt\n    Pipeline: inpaint",
    "86":"XHR (XMLHttpRequest):\nXHR is a JavaScript object that allows websites to make requests to servers asynchronously, loading data (e.g., JSON or HTML fragments) without requiring a page reload. Many modern web apps use this to dynamically update content.",
    "354":"Choosing a more efficient scheduler could help decrease the number of steps without sacrificing output quality. You can find which schedulers are compatible with a different model in the DiffusionPipeline by calling the compatibles method:\n\npipeline.scheduler.compatibles",
    "173":"permutation_test_score: This function assesses model performance by computing a baseline distribution of scores via label permutation, creating a null hypothesis benchmark. Comparing the model’s score to this distribution reveals whether its performance is significant or due to random chance.",
    "266":"Report-only: Success\t\nAll configured policy conditions, required non-interactive grant controls, and session controls were satisfied. For example, a multifactor authentication requirement is satisfied by an MFA claim already present in the token, or a compliant device policy is satisfied by performing a device check on a compliant device.",
    "146":"Classifier-Free Guidance\nA technique allowing diffusion models to generate images without an external classifier, enhancing flexibility in output. This guidance uses the model's own internal structure to fine-tune the output, improving realism without the need for additional label constraints.",
    "296":"Use Selenium to navigate to desirable data - this involved moving the driver focus to iframes and then interacting with elements there\n  iframe = driver.find_elements(By.ID, 'tool')[0]\n  driver.switch_to.frame(iframe)\n  ...\n  driver.switch_to.parent_frame()\n  driver.switch_to.frame('data')\n  sleep(3)",
    "259":"git diff: This command shows the differences between commits, branches, or your working directory and the staging area. It's useful for reviewing changes before committing them.",
    "37":"By default, functions have a timeout of five (5) minutes. This timeout is configurable to a maximum of 10 minutes. If your function requires more than 10 minutes to execute, you can host it on a VM. Additionally, if your service is initiated through an HTTP request and you expect that value as an HTTP response, the timeout is further restricted to 2.5 minutes.",
    "248":"The terraform plan -target= command allows you to run a plan for specific resources, focusing Terraform's execution on just those resources instead of the entire configuration. It’s useful for debugging and making changes to certain resources without affecting others, especially in large environments.",
    "337":"Key\nA key is a unique identifier for an entity within an entity set. In OData, keys are used to locate and identify individual entities, much like primary keys in relational databases. They are essential for accessing specific resources via URLs."
  },
  "hash":{
    "250":"640fd3c1b8014d88534ae7a3b470d2d1",
    "179":"20aab684d28d233b15a1fa0051b8e5bf",
    "22":"607533a7ef549b3094b2037d083845a2",
    "302":"45b1fcac68d9d61e146ff02d1725e11b",
    "48":"38a2df0668d02da5d477b73ba0885e50",
    "87":"b49d0e4a54ddacc57efd04a60b24ab6c",
    "94":"903b3107ec7f96598b131c79a2b112d9",
    "134":"89d631342edf13f6b5bca34353c8b964",
    "6":"316b73e1880905271087dbfff8c46f23",
    "323":"69fbc425d5885cde3d5246de2408254a",
    "32":"204d3082b40e52d21a4a9d4f425ec38c",
    "164":"266708d7f7d9838afbd3c9b1c991c512",
    "98":"efdb373cb8627f97e3f95fb18eddb4a6",
    "239":"7da14bed0fb71ea27640010a678ff008",
    "199":"f53be0b3e5aa87711e1e0d298df56461",
    "65":"790cadff880e79b1273567a6e783f15b",
    "9":"fdd381f92069b85aa00c179ec7dbf3d5",
    "175":"ec2a7699f2194d899734e0e982bd370a",
    "226":"9922618093b39a61b5ef1af3bf16c6f7",
    "273":"60078e11aa549b2fe6a14c0dc52cc236",
    "42":"c50873f880f0ab19026687c2b3dda9c8",
    "130":"745247b2c23d9fec6a63ab954fc97fa1",
    "297":"a5346313cfa4af9df8926096c2ddb977",
    "172":"a19464c053391b7379a1b8f1b92d3bb5",
    "192":"c7389cebdde2555d1b95860ac8babe26",
    "309":"05e1f19fbabb6e91d24f7339e6b900ce",
    "119":"9902d48c6f995c7937046b919d8db66a",
    "43":"e1a4ee17440036cabd5a7c81470d76ce",
    "24":"0c774998853cf27a90017fc50d8a95cc",
    "270":"7741c10c4a0ee31e9e53a05e703ce0fa",
    "362":"b81fc301e6bbd9b6613fa1dbbcef6b84",
    "121":"32b5415afe9e7f5267dcdaa926bb648f",
    "357":"c14bb2f04f8bfa147a0b7126416835bc",
    "103":"4694843868161c3bdccfa6fa8dfde90b",
    "339":"4fe35235488db2b8f57c0f315eba5b6a",
    "120":"781ed0d08bf26f44ed0547c4dd21009c",
    "56":"068a2078e6e9c3714ad2d77030a42f67",
    "66":"4b35a67a5e246065cd3e4e94a3433734",
    "285":"61fb162c72fc69d3f4c2afff1a16fe8b",
    "324":"efdedcbfe2e65ee38ac3d10f262bee62",
    "364":"5be88034bc059e296084cff4e3548785",
    "317":"b92c80afa5013fdb82e5d176948d02b9",
    "78":"8229c364af46d999e5b82fd475cd8335",
    "188":"a994142d0e997a39c710964e66e3b1bf",
    "352":"b7cd2d381a70974dd5c4efb35540e8b5",
    "347":"8214f68479880693a8c296e138571b7d",
    "313":"7f424bcb2abd488ffd98a5f11ddf33cb",
    "220":"40001516b0643b57f49ff5baf453b4b1",
    "54":"113c2d770f43445509725df0d78b7244",
    "229":"44aebd48585dc8219471b4cc8b103672",
    "68":"a8317c40061ece734990d7b60a96683e",
    "277":"9818e2ebe36139ec05f56227ef5f4930",
    "74":"874caf7a81f89dd3ca5ddccfa16afae5",
    "157":"fc5b3f2ef8a3d923e0c7a01306e87246",
    "0":"6b69f6222e4884627bbe26cd3b565b09",
    "34":"daaba655c66451f525495d600524a4e7",
    "281":"52c778e7cd5e07dae5bab317854f9fff",
    "154":"fcf739097da78a358d637ef5d1178233",
    "214":"6da3145369a3caf192a0f28e35bedd3b",
    "301":"3b26d9446d82006da773fec8b8c68920",
    "195":"db84439733bdc1ccc6f7c6662b1f6772",
    "150":"c9cac70a8643ce4d1417ecc2a4d50461",
    "320":"552f61b3d0e93b76a2bb4a5602baa34f",
    "251":"0a94b9586de2e120a12ae44db581156f",
    "29":"04ae55826e9671a39359368f13ae7a88",
    "14":"4818085ea2a0800c7cbb1f92fe3e55d6",
    "197":"770330bed7601963d7b9c3ce686879a5",
    "30":"21dd3e73f4e6a730d1da7eaf24d8912e",
    "286":"e42095222ce6146ad127a28cd3470e65",
    "340":"eed9f81cb9d69a3dce61a716e3fa3cf9",
    "140":"caf1d454763ac691ca4a2493885c9659",
    "219":"7338326083f3ef4c854669a811bccc7d",
    "27":"0f4a4c3463407837d737cfda87323f13",
    "325":"7a1aa7e379fef734217ef83475e6a316",
    "110":"261169366fb894285830b21c0aa8860d",
    "69":"4da8050f3b6e3bef6817c14bac7e2908",
    "351":"72502694afdcd59ba18edb412613112c",
    "299":"a97eca46aa64de6ee2b60b71d45b756e",
    "283":"5c6de8971873b3d0c023e33c0608b956",
    "298":"02934ed03eedad0e5da3e4ff28d6d0f4",
    "26":"5bfff3706a6c8fe5570f991eb355c83d",
    "221":"9e9966b27ec1e83369adb66998874cb0",
    "252":"cdd4166138e5de1bea63c85aba6efed1",
    "287":"916c114f34f4f1a36dc36e74ce8b772f",
    "241":"5879890d69b5e260a7caeb9d34a1fa64",
    "205":"947ae83cb4f87d30bf3be53fca97f6b2",
    "315":"a33c75ddca92427de4659e0be21f3a45",
    "156":"fded51868af75a71b120957cd185e714",
    "276":"d13e39177d60d6db34291cf7450e8a89",
    "44":"82f2e6d5d353730ed498cc4ce6b9c82a",
    "61":"3426841b689bbde580065135d3f740d1",
    "233":"b5f29ee62bb95dafd56a5f4c2aa77106",
    "333":"4e8b1fb146fdd870261d6913a1cf6080",
    "153":"7f4b2da9dadb31749f50ef409cc33354",
    "322":"dfeadf2dc34f5c52473326752587fcd4",
    "171":"35d2388d03a9da0debbad267bf6ad1f4",
    "247":"13fa938f1b6156244280d4dba53ebd0d",
    "4":"ad8039b7c4a3b134b904fb032b839cfe",
    "93":"3a367195f256028b80687f932c26613f",
    "176":"2462107852303b3388f9776f22f74cc7",
    "209":"c0edbe301dca9cf5db0c0db362bc9054",
    "162":"3c5e2ca1372ac5e457941ba4e97648a6",
    "335":"ef8c26a032a9ced1d247ce1296e8fd91",
    "180":"3c02edfe38fb31357eba53f2e1142985",
    "215":"200c2e63ca07fa3b2a862ce2b0dfd85f",
    "249":"2209d496d4e01dc0fa4f4e1edf4c8abb",
    "307":"3e7a8802a146f963794513328fc2e155",
    "236":"b7425cd6aefb5d15cc107d16e7be60c0",
    "304":"44b237b8e558e4cc0f48efc03675f0a0",
    "203":"444a81db87c87213204572ed22ceea64",
    "64":"1f2f610198f68f7c178d586ae45973e8",
    "194":"fc5054fcf13b3189012cf676692c4f29",
    "84":"5181fa672f204380aa40d352752a3dcd",
    "289":"911c8c3f9f5e11c49670dd3c7c77754d",
    "2":"27aaa94f1a411798b9e7ba45fae03eef",
    "62":"4d8fd602d8bfa654c315ac269f52d86a",
    "11":"02d12ed8095689928260c6765fa1a47b",
    "170":"8dfbedb42966d9fb76173251d73b5d6a",
    "190":"4f6d811c33c9f4c0a5649a91ec857826",
    "260":"01416b185ea13d5288fbf51675af35d8",
    "312":"8ac58d9df67044c328c7531fe3ea8171",
    "280":"5dbe1e9c21756dabfafc61be2dab2409",
    "79":"1dd9f8495a55f324f899ad2ec9466a6a",
    "204":"6d130db555c30f51a2aed1d6dd38a584",
    "106":"ba8e3f6648e157e77bf5317f376e3052",
    "83":"4f6fd0f7fcfd0e3ddb0b1328f827b68d",
    "318":"830bc033387c10c2f2fa8cc8e16d2815",
    "254":"b8adfc6caed71a688e1a5e5e0bce8dad",
    "184":"7196b69df136f94d4741c889ed7a4f98",
    "12":"fba7139fd331ebbf61b0c7edd9ded0be",
    "142":"e18590d80494eb71bd98eaa7d0c346af",
    "3":"ceec6698e03b176f06dc04721e5f6456",
    "191":"3a0af754d5909a32b6633c9407900dad",
    "288":"bd27f134b74a2829a40f6c953483f1ed",
    "234":"7500b61359b81b9544f889ecc7ec2550",
    "348":"c47f38f9a21e5d574f4667e9be063566",
    "294":"7367393b770c9b331cfdefe3c30f01c5",
    "310":"23482d3e7b7c9454ffbf4365ed47fbbc",
    "341":"8993daeff9e12b5218704d4db32f6645",
    "82":"d6855177454a2de2b0de90180a73cd75",
    "101":"5aa8b5ca756a2d9abe1292c790b0f3a8",
    "75":"deabaf231b2011c2ffc5c415878219f9",
    "305":"c456276e30350cb9fb497d94fd29beb1",
    "138":"7792b02e5cbf678111837dd1a85af009",
    "35":"3fcd8168e21cee92ca6e1cf8ce80b4df",
    "201":"7680fe9397828db0362832720191b16b",
    "235":"28bc71b2be4ea10648297b445ba49b56",
    "33":"fb79a219774a3964029a13f87e447b8d",
    "17":"7d31a36b7d5f941825dc12b51d1813f8",
    "344":"127f12b267e05c420615dd06b2d82f97",
    "137":"5e2f585e79f3ce64ad92403d33c05017",
    "264":"6c7c93d8ebef2cda39d6918d72d18fe1",
    "177":"cc438d68d02c26609d292bfdf1c1fd58",
    "185":"8c320b13ec34b06ca56777b5571304a4",
    "50":"454bf0a72d6b1d0ad6d958c3efe6f999",
    "1":"12a87b029b5bb8ac8951e6cf3ffd144d",
    "342":"37d2329f16107277a0416409bdbcae5a",
    "63":"3741107968cff74b73d068bca453a667",
    "36":"ed4b9ad5a81d5e638c61d6cd7e32bf01",
    "345":"145b3bda0dcd0a6f613e8c2e30f5262e",
    "213":"b3f73714e6b6dd3887df7c2d2effb595",
    "21":"2e743191dcafd6d466b6b1fc07e02796",
    "207":"c7676ef41347ec8fc19837064091fba7",
    "196":"a410743b2503502074099ec64d42df94",
    "108":"5cb29b92ba9ae794ee0f8af30d47c348",
    "91":"c932079940e7ddbd2d7efd59d0d80a9b",
    "355":"eff6b91a6b52ad5e21804bab9cd3f529",
    "200":"d40bc62055ea91f9bfa457ed28724176",
    "45":"15bc37738621b4881dfed6c5ea5135b1",
    "306":"4261aa399734d5ac523c366d82db3338",
    "303":"0dfdc2d1cc54d89f099641ac97a33089",
    "227":"6c83d1ec0c1f3bc504757ba5f50c5ba7",
    "182":"b8e6d739eaf408b4ab9448ce48ef8036",
    "265":"433901fd41f064481a79c69278a40364",
    "125":"464ecfe392e3c8b65b06f00cb9dbab84",
    "105":"06063e9779d63605847da524a3dd4317",
    "228":"a217dd22ead1e6f4bbdeaf54119d7c85",
    "363":"bfa10a4e607d12744567acb3d10da5bb",
    "135":"02f7d5a7ab0de0f5eea71bd43ea6f858",
    "113":"6da3d91eec9388eda33ce2dcbf0aaa86",
    "359":"15f44fc8521cd9dcc4483ce56f3a6232",
    "149":"f37ffdcaeb5ecfc996e4a893e3219683",
    "230":"df038957900e5fc2d352db08031b5786",
    "124":"b0159957e08e2a7a5dfa8507183ef3dc",
    "292":"c0971a18665dc56f992f6ad349f6af65",
    "71":"9fdccec663c18e832c7b4572059c1d68",
    "218":"d3f311d7879c38c00ee0ca61849cf599",
    "109":"fb2d8aff5f53cca1897094bc4542eb25",
    "206":"33ef725508500650fca45dcdaaabb868",
    "151":"8b34f746b44489c583550ca403f5363e",
    "8":"1c7e4305b93e2cbe17c6eec095745c37",
    "123":"f24abc7932b2d4b1427b9d45ed52f0ec",
    "126":"a97445a5661ae54e36d4b6479e48e6da",
    "346":"d0c412d9f59e4ce78ab2ecc1dfc3bfbe",
    "187":"f7c58cc3d23bf1c564147079cda868d2",
    "127":"fc87effab7a169ef3f5de620c92ca244",
    "361":"db59d82d746cb2d1c0f1b75787e8738e",
    "129":"c3315222d20603b0d72145e7cebfc596",
    "67":"7d2287e600f4227e74202e88336422df",
    "16":"4cb15fdc32973d40d7abdbdcd7a4d4c1",
    "329":"3dd76071c71cb40df61e94808ff5b46a",
    "186":"782e446c70745b9390f2edfb8dd95002",
    "90":"3e3700b1f45b28937ccffd496ee03f13",
    "222":"0a80f258f50f95017047878e1ccaeb25",
    "52":"c4b8222ecdb2c8c755df523bddf91330",
    "25":"44f1653fa2ef87ec33a19dd17f5feecc",
    "115":"e7066ac9d382d7ce573d75192967bad3",
    "31":"94c64bd2dad9303c90cc11ace1dd076a",
    "272":"bf7fd539f9d8a48779a06f1cec3db918",
    "178":"a450b44702015d9bcd2e17cffe21880b",
    "158":"e1fd2fdd4d5959e31da1a7d982a44164",
    "5":"1f4626cb57770b4362641c339667237a",
    "356":"d8cc89cee1c33af43b431eca3e19469a",
    "202":"ab7e4a1769d3cb611aa8b273522751f5",
    "77":"59875b6b2414fe3d1e728de09b964b55",
    "10":"676ab9497a702e294f60de6b3d82f535",
    "332":"fd2dc09a3675cb4d23112824fce80b4b",
    "57":"cd20faf9208b99976b12cef717996ee5",
    "327":"a07b68041a609212abc4d89735f62aff",
    "316":"68de2440d8192c3cc7e71d267a5f307c",
    "15":"0a364bf33bc206a324972b0790881000",
    "334":"f6ee714e6a98efeb6b1bbad8a3c80c5b",
    "39":"74732f5906f5d4d4760b1f970ab6978a",
    "143":"325f309b0e7ef03d26f8fa03d36beb71",
    "330":"116b9942881e3e6fb092c4256fe3e256",
    "189":"2a738209b6083b3b7530ca048648233c",
    "47":"232977ce805e82b6bdf3ae0f62cbdc4d",
    "211":"08f608eb929c3c7e3e0c3489472e902b",
    "308":"e737d6efc99bcb0672fb4cad93b5b1b1",
    "338":"c9f29854fc6a772f5e22c7f979ba16fa",
    "183":"77d02462e167694eab77881ad8943322",
    "269":"7c6e25a9640a6b1fd4c8c3f2d6ba3606",
    "19":"4fe35abbe0f88cf245115af67c03516c",
    "243":"d1fe9199fef3efa9a48245e11d8ceff6",
    "148":"8a7a297394f51006e3ff94f439923c56",
    "232":"87ce6a803e754c1046fac913f3bc567f",
    "240":"f2fdca585a326c43df53333f7233874b",
    "165":"0104d2a194fbb32b4288eca1293504c9",
    "314":"e9547c6407e06f844ccd0283266ffa67",
    "76":"de99a2b8954b4dc1f0326b592c094dba",
    "141":"d3b755f51b168743e9b4a556a8211845",
    "245":"af75a6029c7b258a77de1b930aed60fc",
    "40":"92da3e212ca7c72115d05183ead08f9a",
    "295":"213984ef6d7494a34b449c860e63d2d3",
    "128":"a1fe67b1c263c4bb2a93f691cd50f2a6",
    "253":"49bffa4d76628f5b699b50026cd80ebd",
    "231":"bc575e5be6b075683a33ad58ef1c9060",
    "95":"0badfccd32806fd59704e93fb2087e27",
    "96":"b1e0543bc2462c5c8c4492ca6073abe2",
    "237":"5c3e85df02d00ab354fb612c17f35134",
    "167":"cb435986f686f057413b2a9fa8075e16",
    "336":"589db583be72ea1d87a0c204c504a5d9",
    "97":"8d15e586e7ae2f10c500d5c57eacc946",
    "290":"4b8a436811116a19aaf576947bc1d500",
    "46":"a801ae4199f375421e988bad884602f7",
    "111":"2b727e0910a39a004deac65ef7073e47",
    "7":"7960bf9a4b2fafb70782e90e60e57267",
    "360":"2b62fe83c4968df62cc43574bf50e349",
    "166":"127e0fbcecea168f13d0bbc0a10a1081",
    "278":"7493c547aaa56066bb3c95532bd53ae0",
    "331":"13b696dff1e91fc554db73c2c8dfd739",
    "174":"0205601fa7e3d1bfd911b1d189a06d75",
    "73":"1a2ba7e3043dd89f237ddadf671efb2f",
    "225":"a024bcd8e0afc70ea1715aa8b49ee3ca",
    "38":"39d377ec4e301180b2e8174f65091692",
    "257":"f7e3a6c7776d532b620a40e49d354373",
    "23":"bf8051e965fae944e857b5bbc9bbbd58",
    "159":"d90f4516a480b9ddf9d11b3eebe24f3c",
    "319":"d811193dda85a385e96a2333f3e27934",
    "49":"139392bb38c666d2b3cdb24e649746a0",
    "133":"9f05ea1c19727cb36f9fc56e967f240c",
    "155":"d35aa090b44cbb1313ec34b7c78edf7a",
    "81":"156a34280c42128b66ec481fa994ea63",
    "242":"493d2025b15649f4e4bf4bf206d4285b",
    "261":"d473df111c543108aa3d0c12a4d332a1",
    "104":"2d844cab92c508717bd67c802a1d226b",
    "326":"3c08814aea7ad722d8959f3c1c6ab2f7",
    "58":"f6192ea0bd1926eff3ca7fa70211a0a1",
    "311":"d0226a87c4f37a9849cc5d8b6fe08afb",
    "262":"653a16914f5d053f0123b4ed5c8d0f52",
    "282":"1134140a80c4e9a397c829d79d0abacd",
    "161":"6e5fbf298d632183f76297fb139e670b",
    "152":"7aa89155f3daee9140457f951eb5997b",
    "102":"dc1d3e9433efda233a156cd21b422839",
    "181":"6df19f50de3d3ae4e60d5a02551db623",
    "60":"dc60cecaa62370ae64a38fdccea4723f",
    "291":"c7dc50c205e26c29be652a67ea7a973e",
    "216":"cf5d14cf4ea09a494fa39ef8624f4abe",
    "349":"81020a010a277d1dbac6b77119cd5f64",
    "293":"cbd0f4e392639e39a8fb04b559ed13b5",
    "212":"390514d5f06b555a8ae667f13fac7027",
    "122":"393a92ab306dac54215cac36031237c8",
    "258":"2d119ceeb7eed51ede61d9615e413246",
    "284":"2e8025c0527ca34faf39ec2901a80fea",
    "217":"0437a125070936e171967fa4d8036ccd",
    "193":"9d719133b73056252ab4fc277fb37135",
    "144":"daa335d1ce36b1f4f806d09e5c47ef5e",
    "80":"c785fe2bbeca22b4949bfbf94a89fbff",
    "132":"d8bafb4dfaa8edd97e63a3abf885a3b3",
    "160":"e5d442535d30260a98f515b425a0b585",
    "55":"40362ab211bda7b7a97e62ae6eed4f99",
    "223":"6171d68e2c6719c4d7a995e9ae706e2c",
    "169":"377b2ea6d2dd2b3a0896abe4a87e20bb",
    "107":"7fc86f4ebe74f0dc8f113144d1f785d1",
    "238":"d965fd19e831d6c010bbfa0990500648",
    "51":"e59954d311450407b6465af67d023e14",
    "350":"33f974a90a529fc459bebb059cab2c1f",
    "300":"18e316b5a67549e3a076fa2c4b27202b",
    "85":"550568a4f64d549466b8a21610b07580",
    "275":"3346a2199c02ca60b141eff6d8802d70",
    "267":"d38d0a2b5b23859e6e661b151e31c454",
    "274":"682c5f1ccaadeb1d8daad09ac0604473",
    "100":"6200a704714b5e64c3e8641318ea01e7",
    "244":"d9b2db7c5f3a503d7a94e5260d69dbf3",
    "147":"afec1e26e60afb36c459281b817feff8",
    "99":"d23c7a4f45e2e7d6303e11c7ec203f3c",
    "145":"a551c02d718c04c94e6b16fe94e0370d",
    "72":"553f54e5508c3acca602c0c13b5c0764",
    "112":"42884ea76d7ddbbfe96f95fe2f9a2593",
    "20":"a24480db25c7c1d65511351c842bcc7f",
    "343":"50635c412afa2fa925fd40f1f5609807",
    "118":"396c6b73832a9d9ad8b8c0e6d9ef13b6",
    "92":"0c0ef22e9f050c01da7c7c5034999820",
    "208":"93220b9ee02cffefb5d859be13c52ef4",
    "18":"1bb0c3789de950ab09fa8359d79b8a55",
    "210":"550e4bb1c653449e9d2e441e94990462",
    "246":"9f4bcbbada0e9796503c9e11bb13cb69",
    "163":"fda018b0b93b0865cf1ada114d19a584",
    "168":"a7c2c8c46e52506475a4357f062aba73",
    "114":"d57f3c79d6c0f49f5415d87a269a1086",
    "70":"d44782380f6e441bc4bd22c2220ec075",
    "321":"c0716255f34803ba3545082187754f2d",
    "117":"e700be406faef2414da1de480e3769b7",
    "59":"d4a50327fb4f559d5ee237e2e4b86135",
    "131":"5615edc653c26ebe34f68b16e61f38fa",
    "271":"8526773e72e987800d6c114c04e18e77",
    "136":"f4d23b3a726c224f403df2ffdfe2fffa",
    "255":"047408074f72eff3f0546e327c0583ae",
    "328":"846f1057be1d337dd6100431f86d5514",
    "53":"b6e2c1d9b66e7aa01b20c8af24073c37",
    "358":"e290583d4b0a288a9b8a9eac8593a50f",
    "88":"2c5d7b6815993b5298c2f0839f1a0ab6",
    "89":"b431f55c2d83b0804e20e13bab17764e",
    "256":"adb46e0bca5d08bc77e711bfd70d7e99",
    "28":"69f4a149f2ed2a85967e6eec1dbe5f2b",
    "198":"84ceb3bed96b3bcffa7a6c0319dcfe13",
    "263":"9c74ec62220ff8a10b5742d1e20adcbd",
    "116":"e2e87ecb91d52a80fb53edbd36660a5d",
    "41":"24e8a5ffabee8d40d521a47a958f70f2",
    "139":"ea7d8e93fc43979bc0cacabaf3c3db23",
    "353":"b4c635318e0167ffa9088203a64d7c4d",
    "13":"0e4e6d42014a70f86f841f8e8df5a394",
    "224":"800e9522c36a26dd5f6d141fb297f2a9",
    "279":"ae4548df7f8127af5d33bddec85be3c9",
    "268":"02e087e5dd26cacf7bbd59b834d03a4f",
    "86":"b725ae7e1c3ef799f19f096c85401ac1",
    "354":"329db08b8494c9d2dcea7e559d09c3cc",
    "173":"ffe33ee61bc3c28e006c3d7bad803ea6",
    "266":"d603a9848356cbd581a4a3e92a19d64e",
    "146":"7db77ec1919c8fa6b34c2594b0ec50cb",
    "296":"c4cf03455db0320a1a29385027d9895e",
    "259":"14db1e0d08133b2c36b8fe2517d7e21c",
    "37":"36721d9077790b7d88c4626328a90955",
    "248":"3ad6fa0159b83658ae5ba7f3259071ce",
    "337":"1718d18c353586d7e09f874901a995a2"
  },
  "age":{
    "250":4.1703111758,
    "179":4.0254399066,
    "22":4.0132763499,
    "302":3.9339886567,
    "48":3.8823337732,
    "87":3.8410032995,
    "94":3.7977578397,
    "134":3.7774130433,
    "6":3.7511685513,
    "323":3.7418758458,
    "32":3.7197676576,
    "164":3.7168358787,
    "98":3.7035114648,
    "239":3.5840980959,
    "199":3.503656673,
    "65":3.4544775098,
    "9":3.4289823962,
    "175":3.3949695917,
    "226":3.3864745127,
    "273":3.3764214001,
    "42":3.371637234,
    "130":3.3656573241,
    "297":3.3645412796,
    "172":3.3607453062,
    "192":3.3334312949,
    "309":3.3331816038,
    "119":3.3266106545,
    "43":3.2824976279,
    "24":3.2765764813,
    "270":3.270998855,
    "362":3.2688960704,
    "121":3.2674817348,
    "357":3.2642863692,
    "103":3.2507149669,
    "339":3.2494904288,
    "120":3.2431503386,
    "56":3.2282614313,
    "66":3.214608706,
    "285":3.2121014174,
    "324":3.2117028937,
    "364":3.1658795216,
    "317":3.1590163438,
    "78":3.1519896393,
    "188":3.1345347405,
    "352":3.1338376973,
    "347":3.1281107249,
    "313":3.1224742617,
    "220":3.1063238153,
    "54":3.1053429862,
    "229":3.1039362962,
    "68":3.1001808245,
    "277":3.0987183308,
    "74":3.0963752614,
    "157":3.0950785611,
    "0":3.0739645677,
    "34":3.0678279964,
    "281":3.0594720116,
    "154":3.0261877444,
    "214":3.0249503138,
    "301":3.0235837658,
    "195":3.0114904424,
    "150":3.0018125158,
    "320":2.9982320019,
    "251":2.9965235307,
    "29":2.9853977399,
    "14":2.978198705,
    "197":2.9574825551,
    "30":2.9523294915,
    "286":2.9511184083,
    "340":2.9413311902,
    "140":2.9379409071,
    "219":2.9365966008,
    "27":2.9228760373,
    "325":2.9198880391,
    "110":2.917145486,
    "69":2.9168868477,
    "351":2.9147936358,
    "299":2.9092979019,
    "283":2.9018905933,
    "298":2.9017023631,
    "26":2.8935087364,
    "221":2.8923867674,
    "252":2.8800357696,
    "287":2.8678745739,
    "241":2.8511432439,
    "205":2.8477262218,
    "315":2.8446481683,
    "156":2.842610983,
    "276":2.8364510104,
    "44":2.8354483653,
    "61":2.8349439577,
    "233":2.8307704607,
    "333":2.8011389215,
    "153":2.8002766494,
    "322":2.7952505123,
    "171":2.7915729941,
    "247":2.7823333011,
    "4":2.7659477586,
    "93":2.7644857079,
    "176":2.7472497239,
    "209":2.7444949586,
    "162":2.7431788922,
    "335":2.7291621481,
    "180":2.7273202028,
    "215":2.722123064,
    "249":2.7086239309,
    "307":2.7072138742,
    "236":2.7064235129,
    "304":2.7063306038,
    "203":2.7027088986,
    "64":2.7025574489,
    "194":2.6973997363,
    "84":2.6910601552,
    "289":2.6852425444,
    "2":2.6835090284,
    "62":2.6804558473,
    "11":2.6765350821,
    "170":2.6749492825,
    "190":2.673046461,
    "260":2.6719254839,
    "312":2.6683525389,
    "280":2.6610853648,
    "79":2.6601345999,
    "204":2.6597222954,
    "106":2.6545142888,
    "83":2.6499486499,
    "318":2.6384769043,
    "254":2.6106434098,
    "184":2.6090433208,
    "12":2.6066155166,
    "142":2.5864686414,
    "3":2.5789229489,
    "191":2.5778238007,
    "288":2.5723299048,
    "234":2.5717270007,
    "348":2.569187801,
    "294":2.5579805972,
    "310":2.5510136817,
    "341":2.5449261464,
    "82":2.5418877763,
    "101":2.5418178317,
    "75":2.5404034213,
    "305":2.5369956248,
    "138":2.5350531807,
    "35":2.534698568,
    "201":2.530903453,
    "235":2.5256287557,
    "33":2.5190618764,
    "17":2.518476391,
    "344":2.516987556,
    "137":2.5151259164,
    "264":2.5146615912,
    "177":2.5144191449,
    "185":2.5039058379,
    "50":2.485887778,
    "1":2.4829569538,
    "342":2.4716746998,
    "63":2.4716690023,
    "36":2.4714248787,
    "345":2.4711775035,
    "213":2.4645509205,
    "21":2.4637518905,
    "207":2.4611897693,
    "196":2.4589372274,
    "108":2.4578070797,
    "91":2.4573836683,
    "355":2.4435789958,
    "200":2.4342389171,
    "45":2.4337658348,
    "306":2.4317980193,
    "303":2.4306767585,
    "227":2.4264912015,
    "182":2.4255564021,
    "265":2.4240209447,
    "125":2.4189745975,
    "105":2.4133832376,
    "228":2.4101232887,
    "363":2.4000873109,
    "135":2.3906285251,
    "113":2.3904625913,
    "359":2.3881249609,
    "149":2.3687267107,
    "230":2.3682159378,
    "124":2.3681901564,
    "292":2.3660756426,
    "71":2.3654526866,
    "218":2.3641807637,
    "109":2.3592774951,
    "206":2.3552691063,
    "151":2.354667804,
    "8":2.3485567195,
    "123":2.3480508266,
    "126":2.3456182529,
    "346":2.3421906301,
    "187":2.3389629093,
    "127":2.3324419569,
    "361":2.3238256962,
    "129":2.3231109035,
    "67":2.3222291808,
    "16":2.3102831947,
    "329":2.3098252434,
    "186":2.3084412791,
    "90":2.3069422298,
    "222":2.3057133701,
    "52":2.3048844168,
    "25":2.2961543137,
    "115":2.2940170521,
    "31":2.2918892947,
    "272":2.2798393792,
    "178":2.2790045731,
    "158":2.2706484687,
    "5":2.2700358444,
    "356":2.2675140048,
    "202":2.2606185126,
    "77":2.2601867178,
    "10":2.258272419,
    "332":2.2558748234,
    "57":2.253845504,
    "327":2.2492421006,
    "316":2.2486901802,
    "15":2.2480293332,
    "334":2.2412110775,
    "39":2.2096897729,
    "143":2.2094772106,
    "330":2.2070775548,
    "189":2.2053711249,
    "47":2.1986295363,
    "211":2.1974614758,
    "308":2.1963155956,
    "338":2.1947654428,
    "183":2.1884995833,
    "269":2.184741566,
    "19":2.1754065752,
    "243":2.1671094519,
    "148":2.164040686,
    "232":2.1562053403,
    "240":2.1554691882,
    "165":2.1541036946,
    "314":2.1537947161,
    "76":2.1520728875,
    "141":2.1518958707,
    "245":2.1481364621,
    "40":2.128274234,
    "295":2.126957848,
    "128":2.1268903289,
    "253":2.1245991088,
    "231":2.1230428169,
    "95":2.1167543374,
    "96":2.1120598801,
    "237":2.0968931824,
    "167":2.0968723004,
    "336":2.0784816808,
    "97":2.0749810666,
    "290":2.0745027312,
    "46":2.0741976246,
    "111":2.0578534707,
    "7":2.0540273589,
    "360":2.0514753014,
    "166":2.0459820614,
    "278":2.0420371976,
    "331":2.0353950268,
    "174":2.0293912327,
    "73":2.0281096958,
    "225":2.0264021337,
    "38":2.0162716604,
    "257":2.0102972885,
    "23":1.9972616122,
    "159":1.9906058784,
    "319":1.9866668622,
    "49":1.9827198657,
    "133":1.9816598264,
    "155":1.96982795,
    "81":1.9688547445,
    "242":1.965918688,
    "261":1.9485743112,
    "104":1.9463635281,
    "326":1.9401618985,
    "58":1.9381341629,
    "311":1.9241094784,
    "262":1.917833421,
    "282":1.9098348916,
    "161":1.906067168,
    "152":1.8879356428,
    "102":1.8764358183,
    "181":1.8715228823,
    "60":1.8553105688,
    "291":1.8386656361,
    "216":1.8296035831,
    "349":1.826902535,
    "293":1.8029959287,
    "212":1.8008151794,
    "122":1.7918429306,
    "258":1.7883319932,
    "284":1.7735986002,
    "217":1.7712119672,
    "193":1.7675945495,
    "144":1.7633710696,
    "80":1.7591188704,
    "132":1.7459055828,
    "160":1.7407094845,
    "55":1.7333944123,
    "223":1.7221021061,
    "169":1.7085702538,
    "107":1.704469516,
    "238":1.6994713167,
    "51":1.6974349267,
    "350":1.693255633,
    "300":1.6916536882,
    "85":1.6831034142,
    "275":1.6812647313,
    "267":1.6751388225,
    "274":1.6739605154,
    "100":1.6720038591,
    "244":1.6715837167,
    "147":1.6631734771,
    "99":1.662805807,
    "145":1.6620186748,
    "72":1.6579639125,
    "112":1.6450544813,
    "20":1.6309472155,
    "343":1.6265568047,
    "118":1.5635141939,
    "92":1.5615496827,
    "208":1.5532858213,
    "18":1.5453290788,
    "210":1.509806283,
    "246":1.5075939059,
    "163":1.4996142312,
    "168":1.4903639635,
    "114":1.4893998512,
    "70":1.4763313796,
    "321":1.4719061121,
    "117":1.4656460208,
    "59":1.4638562848,
    "131":1.4586150091,
    "271":1.4482751049,
    "136":1.44240891,
    "255":1.4410757322,
    "328":1.4362162494,
    "53":1.4228947172,
    "358":1.4136086209,
    "88":1.397973164,
    "89":1.3920386049,
    "256":1.3661436313,
    "28":1.3368444414,
    "198":1.3260794762,
    "263":1.2494776497,
    "116":1.2419358691,
    "41":1.2397012493,
    "139":1.2241089409,
    "353":1.2007265102,
    "13":1.1771341757,
    "224":1.1369330284,
    "279":1.1340670499,
    "268":1.0875408001,
    "86":1.0214876465,
    "354":1.0195848469,
    "173":0.9993164032,
    "266":0.903998023,
    "146":0.8556181725,
    "296":0.8399688104,
    "259":0.8088721029,
    "37":0.7863919344,
    "248":0.7715072986,
    "337":0.6160588279
  }
}